[
  [
    "Dad. He keeps saying it.",
    "James, give it a rest.",
    "Every day if you want us to.",
    "No. Not every day. James says most people only get letters from home about once a month. I",
    "We wrote to your brother three times a week last year.",
    "What? James!",
    "Yes. You may not want to believe everything he tells you about Hogwarts. He likes a laugh,",
    "Can we go now, please?",
    "All you have to do is walk straight at the wall between platforms nine and ten."
  ],
  [
    "This is it.",
    "Wow!",
    "Platform nine and three-quarters.",
    "Have you got my trick?",
    "You smell of porridge.",
    "Bing. Bang. Boing. Young lady, get ready to not being able to smell at all . . .",
    "Ta-da!",
    "You are silly.",
    "Parked all right, then?",
    "I thought nothing of the kind, I have complete faith in you.",
    "And I have complete faith he did Confund the examiner.",
    "Oi!",
    "Dad . . .",
    "And what would be wrong with that?",
    "Albus Severus, you were named after two headmasters of Hogwarts. One of them was a",
    "But just say . . .",
    "If it matters to you, you, the Sorting Hat will take your feelings into account.",
    "Really?",
    "It did for me.",
    "Apart from the Thestrals. Watch out for the Thestrals.",
    "I thought they were invisible!",
    "Lily, come straight back.",
    "Rose. Remember to send Neville our love.",
    "Okay, then. Bye.",
    "Hogwarts is a big place.",
    "I have no idea where she gets her ambition from.",
    "You know, Gin, we always thought there was a chance you could be sorted into Slytherin.",
    "What?",
    "Honestly, Fred and George ran a book.",
    "Can we go? People are looking, you know.",
    "People always look when you three are together. And apart. People always look at you.",
    "Of course he will."
  ],
  [
    "Anything from the trolley, dears? Pumpkin Pasty? Chocolate Frog? Cauldron Cake?",
    "Al. We need to concentrate.",
    "Concentrate on what?",
    "On who we choose to be friends with. My mum and dad met your dad on their first Hogwarts",
    "We rate them all and then we make a decision.",
    "Hi. Is this compartment . . .",
    "Rose.",
    "Hi, Rose. Would you like some of my Fizzing Whizbees?",
    "You are hitting me, and it hurts.",
    "What?",
    "What do you mean you know who I am?",
    "To send her back where?",
    "Yes, well, we probably should sit somewhere else. Come on, Albus.",
    "Fine!",
    "Thank you.",
    "Yes. Sorry.",
    "No. I like it. Do you prefer Albus or Al?",
    "Albus.",
    "THANK YOU FOR STAYING FOR MY SWEETS,",
    "Wow."
  ],
  [
    "Albus Potter.",
    "A Potter. In our year.",
    "Thank Dumbledore.",
    "Scorpius Malfoy.",
    "Well, that makes sense.",
    "Albus Potter.",
    "Slytherin?",
    "Whoa! A Potter? In Slytherin.",
    "You can stand next to me!",
    "Right. Yes.",
    "Well, what are you all waiting for? Everyone stand by a broomstick. Come on, hurry",
    "UP!",
    "Yes!",
    "UP!",
    "YES!",
    "Up. UP. UP.",
    "Albus Potter, the Slytherin Squib.",
    "Okay. Children. Time to fly.",
    "At Harry Potter and his disappointing son.",
    "What does that mean?",
    "At Harry Potter and his Slytherin son.",
    "Slythering Slytherin, stop with your dithering, time to get onto the train.",
    "Unnecessary, James.",
    "See you at Christmas, Dad.",
    "My name is Albus, not Al.",
    "Are the other kids being unkind? Is that it? Maybe if you tried making a few more friends . . .",
    "But I wanted to be here . . .",
    "I need a favor.",
    "Draco.",
    "I know. We just need to keep the pretense up in front of the grown-ups.",
    "Hi, Rose.",
    "Bye, Albus.",
    "Albus Potter. An irrelevance. Even portraits turn the other way when he comes up the",
    "With just a little salamander blood . . .",
    "Everything.",
    "Third year. Big year. Here is your permission form for Hogsmeade.",
    "I hate Hogsmeade.",
    "Incendio!",
    "Of all the stupid things!",
    "So what would you like me to do? Magic myself popular? Conjure myself into a new House?",
    "Say nothing.",
    "Is there anything . . . ?",
    "Come to the funeral.",
    "Of course.",
    "And be my good friend.",
    "Yes!",
    "Great.",
    "This one does."
  ],
  [
    "How did it go?",
    "It was true.",
    "Theodore Nott?",
    "In custody.",
    "And the Time-Turner itself?",
    "Well, now we have it.",
    "Apparently wizardry has moved on since we were kids.",
    "What you doing in my office, Hermione?",
    "No longer chaotic.",
    "Not for you.",
    "I truly am. Toffee?",
    "What can I say? My parents were dentists, I was bound to rebel at some point. Forty is",
    "You know, Ron says he thinks I see more of my secretary, Ethel, (she",
    "You really think this could all mean something?",
    "Farewell, Harry Potter."
  ],
  [
    "Sorry?",
    "The Ministry has a Time-Turner, does it not?",
    "The Time-Turners were all destroyed.",
    "Hello.",
    "Who are you? Because this is sort of my house and . . .",
    "Albus.",
    "Not really.",
    "They do all sorts with my name too.",
    "Delphi.",
    "Delphi!",
    "Upper Flagley?",
    "DELPHI!",
    "Yes, Uncle?",
    "Meet the once-great Harry Potter, now a stone-cold Ministry man. I will leave you in peace, sir.",
    "Yes, Uncle."
  ],
  [
    "James, please, ignore your hair, and tidy that damn room . . .",
    "Hi.",
    "Okay. A love potion. Okay.",
    "An old blanket?",
    "Albus, I want you to have the blanket.",
    "Do you want a hand? Packing. I always loved packing. It meant I was leaving Privet Drive and",
    ". . . traumatized by his cousin, Dudley, saved by Hogwarts. I know it all, Dad. Blah, blah, blah.",
    "Moldy blanket?",
    "You wish me dead?",
    "Yes. You did.",
    "Albus, you just know how to get under my skin . . .",
    "Albus, please . . .",
    "No luck or love for me, then.",
    "Albus. Albus . . . Please . . ."
  ],
  [
    "Look. At. Him.",
    "Scarrawhat?",
    "Hello.",
    "You knew my parents?",
    "Who are you?",
    "Hogwhere?",
    "Learnt what?",
    "I forbid you to tell the boy anything more!",
    "Tell me what?"
  ],
  [
    "Harry . . .",
    "Lumos.",
    "Yes.",
    "About what?",
    "Do you want a Sleeping Draught?",
    "It went pretty badly wrong from there. I said some things, Ginny . . .",
    "I heard.",
    "I just wish he was more like James or Lily.",
    "A strange thing to say to a child.",
    "Not when you believe that child will have to die to save the world.",
    "Does your scar hurt?",
    "Harry. How long has it been since your scar hurt?",
    "Twenty-two years."
  ],
  [
    "Me? Why?",
    "We never were friends.",
    "That was a long time ago.",
    "Have you heard the rumors? Big Ministry raid a few days ago. Your dad apparently was",
    "A Time-Turner? Dad found a Time-Turner?",
    "Shh! Yes. I know. Great, right?",
    "Entirely.",
    "Now I have to find Scorpius.",
    "Albus!",
    "Leave me alone, Rose.",
    "Albus! Oh hello, Rose, what do you smell of?",
    "What do I smell of?",
    "Just a slightly weird twenty-four hours.",
    "Too late. The train is moving. Hogwarts ahoy!",
    "Then we have to get off a moving train.",
    "Anything from the trolley, dears?",
    "A moving magical train.",
    "Pumpkin Pasty? Cauldron Cake?",
    "Albus Severus Potter, get that strange look out of your eye.",
    "First question. What do you know about the Triwizard Tournament?",
    "Ooooh, a quiz! Three schools pick three champions to compete in three tasks for",
    "You really are an enormous geek, you know that?",
    "Ya-huh.",
    "Second question. Why has the Triwizard Tournament not been run in over twenty years?",
    "Good. Third question",
    "When Amos Diggory asked for the Time-Turner my father denied they even existed. He lied to",
    "Okay, whatever was holding your brain together seems to have snapped."
  ],
  [
    "The what? The where? Look, I am as excited as you are to be a rebel for the first time in my",
    "Albus. The Trolley Witch.",
    "You want a snack for the journey?",
    "No. Albus. The Trolley Witch is coming towards us.",
    "Anything from the trolley, dears? Pumpkin Pasty? Chocolate Frog? Cauldron Cake?",
    "Oh.",
    "What is your name?",
    "You were right, Scorpius. This train is magical.",
    "At this precise moment in time, I take no pleasure in being right.",
    "Albus, this is a bad idea.",
    "Albus . . . Albus . . ."
  ],
  [
    "Order. Order. Do I have to conjure silence? (She pulls silence from the crowd using her",
    "It did look like the potions stores had been interfered with when we returned",
    "Thank you, Professor. We shall investigate. (She looks around the room.) Nobody else?",
    "Voldemort is dead, Voldemort is gone.",
    "Yes, Draco, Voldemort is dead, but these things all lead us to think that there is a possibility",
    "Now this is difficult but we have to ask it to rule it out. Those of you with a Dark Mark . . . have",
    "Back to being prejudiced against those with a Dark Mark, are we, Potter?",
    "None of those rumors came from me!",
    "The sports pages!",
    "A vote you only won because you are his friend.",
    "Do you want a smack in the mouth?",
    "Draco, no one is saying this has anything to do with Scorpius . . ."
  ],
  [
    "Um, excuse me . . . Excuse me. EXCUSE ME!",
    "Okay, so this place is wild.",
    "And what you boys want with that miserable old sod?",
    "Albus? Albus! You came? How wonderful! Come and say hello to Amos!"
  ],
  [
    "Of course they do. You can move along now.",
    "Help? What use could a pair of undersized teenagers be for me?",
    "No!",
    "Your information was obvious but the confirmation is useful. Your father did lie. Now leave.",
    "Did you not hear me, boy? I see no reason to trust you. So go. Now. Before I",
    "I can think of one reason why you should trust them, Uncle.",
    "This is going to be dangerous.",
    "We know.",
    "Do we?",
    "If that would make you happy, Uncle.",
    "You do understand even getting the Time-Turner will risk your lives.",
    "Are we?",
    "I hope you have it in you."
  ],
  [
    "Her?",
    "The trolls could be going to a party, the giants to a wedding, you could be getting bad dreams",
    "Getting old? Thanks, mate.",
    "You talk a lot of rubbish.",
    "I consider it my speciality. That and my range of Skiving Snackboxes. And my love for all of",
    "Nothing scares me. Apart from Mum.",
    "I mean it, Harry, I will not be Cornelius Fudge on this one. I will not stick my head in the",
    "You never really were one for popularity, were you?",
    "What does it say?"
  ],
  [
    "So we just take it?",
    "Okay, two points, one, is it painful?",
    "Thank you. Good to know. Second point",
    "Double wow.",
    "Right. Me next.",
    "Three. Two. One.",
    "Go to your room. Go straight to your",
    "Scorpius . . .",
    "Welcome, Harry Potter. Welcome, Hermione Granger. Welcome, Ron Weasley."
  ],
  [
    "Have we searched thoroughly beside the tracks . . .",
    "My department have searched once and are searching again.",
    "And the Trolley Witch is not able to tell us anything useful?",
    "The Trolley Witch is furious. She keeps talking about letting down Ottaline Gambol. She",
    "Have there been any instances of magic reported by the Muggles?",
    "None so far. I have made the Muggle Prime Minister aware and he is filing what is known",
    "Albus and I had an argument, the day before last.",
    "And . . .",
    "If anything happens to Scorpius . . .",
    "My son is missing!",
    "So is mine!",
    "The Ministry has plenty in reserve, thank you, Draco."
  ],
  [
    "Minister.",
    "Harry . . . we should talk about it . . .",
    "Oh no.",
    "Hermione. And Dad.",
    "Okay. Hiding places. No hiding places. Anyone know any Invisibility Charms?",
    "Do we go . . . in her office?",
    "Stand back. Alohomora!",
    "What is there to say?",
    "Me. Why?",
    "Ron?",
    "Surprise!!!",
    "What are you doing here?",
    "Does a man need an excuse to see his wife?",
    "I should go . . .",
    "Ron!",
    "But what if sometimes we say stuff we do mean . . . What then?",
    "Why are you blocking the entrance to my office?",
    "You are. Let me into my room, Ron.",
    "What?",
    "I can taste fish. I told you to stay away from those fishfinger sandwiches.",
    "Right you are."
  ],
  [
    "This is all too weird.",
    "You were impressive. Good blocking action.",
    "You heard that?",
    "Where would Hermione hide a Time-Turner? (She looks around the room, she sees",
    "How did I produce this?",
    "Maybe if we could concentrate on the matter at hand.",
    "How to distract Scorpius from difficult emotional issues. Take him to a library.",
    "All the books from the Restricted Section and then some. Magick Moste Evile.",
    "Shadows and Spirits. The Nightshade Guide to Necromancy.",
    "The True History of the Opal Fire. The Imperius Curse and How to Abuse It.",
    "And lookee here. Whoa. My Eyes and How to See Past Them by Sybill Trelawney. A",
    "The first is the fourth, a disappointing mark.",
    "Okay. A book that talks. Bit weird.",
    "The second is the less fair of those that walk on two legs.",
    "A turn in the city, a glide through a lake.",
    "What have you done?",
    "What is that?",
    "The second is a disease of the egg, the less fair of those who walk on two legs . . .",
    "Men! De-men . . . tors. We need to find a book on dementors. (The",
    "Delphi! What is going on?",
    "Concentrate, Albus. Do what she said. Find a book on dementors and be very careful.",
    "Here. Dominating Dementors",
    "I was born in a cage",
    "Voldemort.",
    "Work faster!",
    "Delphi! Delphi!",
    "No! Because I was more worried about her being eaten by a bookcase! Find. Something.",
    "Albus? Albus!!",
    "The Truth, this must be . . .",
    "I am the creature you have not seen.",
    "Albus . . .",
    "Delphi, are you . . . ?",
    "Wow. Quite a ride."
  ],
  [
    "Aunt Petunia. What time is it?",
    "Time enough. You know, when we agreed to take you in, we hoped we could improve",
    "Trying is not succeeding though, is it? There are grease smears on the glasses. There",
    "You disgusting boy. Only animals wet themselves. Animals and disgusting little boys.",
    "And why would I have the slightest bit of interest in that?"
  ],
  [
    "Lumos.",
    "Okay . . . ?",
    "I was sleeping.",
    "You were.",
    "None.",
    "Voldemort?",
    "Durmstrang robes?",
    "Ginny, I think I know where he is . . ."
  ],
  [
    "We need to get searching as quickly as possible.",
    "Is it true? Can I help?",
    "Right. Very sensible. I expect . . . there will be quite a few.",
    "Sorry about your floor, Minerva."
  ],
  [
    "Expelliarmus!",
    "Expelliarmus!",
    "And we have a winner.",
    "Then you should stick around, teach me more . . .",
    "Yes. Yes. Definitely friends. Definitely.",
    "Great. Wizzo!",
    "Yes!",
    "And I understand that, but . . .",
    "So we just need to mess up his chances supremely badly in task one. The first task is getting a",
    "But these are Durmstrang robes.",
    "Good thinking! Hang on, where are your robes?",
    "What?",
    "What?",
    "You taught us how to use the Time-Turner."
  ],
  [
    "Albus? Scorpius? Albus?",
    "Harry Potter.",
    "Good. You still recognize me, Bane.",
    "I have.",
    "But not wiser. For you trespass on our land.",
    "I have always respected the centaurs. We are not enemies. You fought bravely at the Battle of",
    "I did my part. But for my herd, and our honor. Not for you. And after the battle, the forest was",
    "My son is missing, Bane. I need help finding him.",
    "And he is here? In our forest?",
    "Yes.",
    "Then he is as stupid as you are.",
    "Can you help me, Bane?",
    "I can only tell you what I know . . . But I tell you not for your benefit but for the benefit of my",
    "Neither do we! What do you know?",
    "There is a black cloud around your son, a dangerous black cloud.",
    "Around Albus?",
    "Albus! Albus!"
  ],
  [
    "And there it is . . .",
    "Hogwarts. Never seen this view of it before.",
    "And then you got there and it turned out to be terrible after all.",
    "Not for me.",
    "Albus? Albus."
  ],
  [
    "Go, go, Krazy",
    "Rose? What are you doing here?",
    "How do you know my name?",
    "Expelliarmus!",
    "What happened?",
    "I told you. I told you I saw them.",
    "Hello, Dad. Is something wrong?",
    "Yes. You could say that."
  ],
  [
    "Professor Dumbledore.",
    "Good evening, Harry.",
    "Ah, well, I do like to pop into my other portraits now and then. (He looks at ALBUS .) Will",
    "A difficult thing, I imagine, to watch your child in pain.",
    "Candidly, Harry, it seemed a great weight to place upon the poor boy.",
    "I need your help. I need your advice. Bane says Albus is in danger. How do I protect my son,",
    "You ask me, of all people, how to protect a boy in terrible danger? We cannot protect",
    "And what is the gossip about me and my son?",
    "Blinded?",
    "Dad . . .",
    "Ah really, what does my opinion matter anymore? I am paint and memory, Harry, paint",
    "But I need your advice.",
    "Dad?",
    "No, where have you gone now?",
    "Okay. I think.",
    "Much.",
    "It feels great.",
    "In Durmstrang robes?",
    "Scorpius? No.",
    "I need you to stay away from Scorpius Malfoy.",
    "What? Scorpius?",
    "My best friend? My only friend?",
    "A black cloud?",
    "And I have very good reason to believe that Dark Magic is in a resurgence and I need to keep"
  ],
  [
    "Albus, get back in bed.",
    "Do I hear my name?",
    "Of course you do. You run a joke shop.",
    "Your aunt.",
    "I have an Aunt Padma?",
    "Taken a Confundus Charm to the head, has he? (To ALBUS .) My wife, Padma. You",
    "Albus has also forgotten that he was sorted into Gryffindor. Conveniently.",
    "But how did I get sorted into Gryffindor?",
    "Did it work? Did any of it work?"
  ],
  [
    "If you see them together, then get to them as quickly as possible, and keep them separate.",
    "Harry, are you sure this is the right decision? Because far be it from me to",
    "I trust Bane. Albus is to stay away from Scorpius. For his sake, and others.",
    "I think what Harry means is . . .",
    "The professor knows what I mean.",
    "Albus has been checked by the greatest witches and wizards in the country",
    "What?",
    "He said love had blinded me.",
    "But he was right. I see it now.",
    "Harry!",
    "Perfectly."
  ],
  [
    "Ah yes. Our train absconder. Finally joining us.",
    "Hermione?",
    "Professor Granger I believe is my name, Potter.",
    "What are you doing here?",
    "Teaching. For my sins. What are you doing here? Learning, I hope.",
    "Losing patience now. Ten points from Gryffindor for stupidity.",
    "Sit down, Polly Chapman, before this gets even worse. (POLLY sighs and then sits.) And I",
    "How dare you! Fifty points from Gryffindor. And I assure you if anyone interrupts me"
  ],
  [
    "This is the right decision.",
    "You almost sound convinced.",
    "You told me to be honest with him, but actually I needed to be honest with myself, trust what",
    "Harry, you have one of the greatest hearts of any wizard who ever lived, and I do not believe",
    "How can I help?",
    "I have to protect my son.",
    "From Scorpius?",
    "Bane told me he sensed a darkness around my son. Near my son.",
    "What are you implying, Potter?",
    "You take that back . . . right now.",
    "You do not want to do this.",
    "Yes, I do.",
    "How interesting, because I do want to hurt you.",
    "Expelliarmus!",
    "Incarcerous!",
    "Tarantallegra!",
    "Rictusempra!",
    "Flipendo!",
    "I wear it better.",
    "Brachiabindo!",
    "That really the best you got? Emancipare.",
    "Obscuro!",
    "I only left this room three minutes ago!"
  ],
  [
    "Delphi?",
    "Delphi, none of it worked, time-turning, we failed.",
    "Oh.",
    "I had one of those too. Called Flurry. We fell out over the correct rules of Gobstones.",
    "He needs me to do what?"
  ],
  [
    "Sorry about your kitchen, Ginny.",
    "Draco, whatever you may think . . .",
    "Crabbe and Goyle.",
    "I envied them too.",
    "My father thought he was protecting me. Most of the time. I think you have to make a choice",
    "Harry. Will you get the Floo powder or shall I?"
  ],
  [
    "Hi.",
    "Hermione. And Ron got jealous and behaved like a prat.",
    "What?",
    "Sshhhh!",
    "As friends. And they danced in a friendly way, and it was nice, and then he danced with",
    "Wow.",
    "And without Krum, Ron never got jealous and that jealousy was all-important and so Ron",
    "Ssshhh!",
    ". . . is the wrong answer.",
    "Yes, but . . .",
    "Without me? Oh poor Albus Potter. With his chip on his shoulder. Poor Albus Potter. So",
    "What are you saying?",
    "Quick. We need to hide.",
    "What?",
    "Scorpius, look at me.",
    "I am about to enter.",
    "Thanks.",
    "His department are currently investigating it.",
    "Friends?",
    "Always.",
    "About what?",
    "It involves the second task. And humiliation.",
    "I know.",
    "I mean, quite spectacular. Humiliate Cedric to save Cedric. Clever. And Rose?"
  ],
  [
    "Professor Granger.",
    "Ron. What are you doing here?",
    "Panju got in a little trouble in Potions class. Was showing off, of course, and put the wrong thing",
    "Just combed it, I suspect.",
    "Well . . . Combing it suits you.",
    "Ron, will you stop looking at me like that?",
    "Very ridiculous.",
    "More than strange.",
    "I know.",
    "Well. Must get on. Sort Panju out. Teach him the finer arts of mustache grooming."
  ],
  [
    "Mischief managed.",
    "I need to find my son. We need to.",
    "Minerva, I come here in peace, not war. I should never have spoken to you that way.",
    "I need to say sorry to you and sorry to Albus, will you give me that chance?",
    "Draco?",
    "He needs to see his son, and I need to see mine.",
    "Well, peace is certainly something I can be part of."
  ],
  [
    "Yes. Scorpius, that soap, if you may . . .",
    "Nice. Consider me engorgimpressed.",
    "The second task was the lake task. They had to retrieve something which was stolen from",
    "Cedric used a Bubble-Head Charm to swim through the lake. All we do is follow him in there",
    "Whoa. That feels good. Never used to enjoy that. But when you get to my age, you",
    "What did you call me? Do I moan? Am I moaning now? AM I? AM I?",
    "Myrtle.",
    "Well . . .",
    "The second task. The lake task. In the Triwizard Tournament. Twenty-five years ago. Harry",
    "Help us, Myrtle, help us get into that same lake.",
    "You think I can help you travel in time?",
    "We need you to keep a secret.",
    "Well, that sounds like fun.",
    "This very sink. This very sink empties directly into the lake. It breaks every bylaw",
    "Some for me and some for you.",
    "Just like my dad did. Now, are you ready?",
    "Tell me this is all going to be okay.",
    "I do like brave boys.",
    "Albus . . . Albus . . .",
    "How is he doing this?",
    "Myrtle!",
    "Oops, you caught me. And I was trying so hard to hide. Hello, Harry. Hello, Draco.",
    "What trinket is he using?",
    "I think it was a secret, but I could never keep anything from you, Harry. How is it",
    "My son is in danger. I need your help. What are they doing, Myrtle?",
    "But Cedric Diggory died years ago . . .",
    "The Ministry has a Time-Turner? I thought they were destroyed?"
  ],
  [
    "Woooo-hoooooo!",
    "Scorpius Malfoy. Get out of the lake. Get out of the lake. Right now.",
    "Miss. I need help. Please, Miss.",
    "Have you swallowed something funny in there? Become a Mudblood without any",
    "Voldemort Day?"
  ],
  [
    "Scorpius. Thank you so much for coming to see me.",
    "Headmistress.",
    "Athletic?",
    "Has it?",
    "Questioning everyone you can about the Battle of Hogwarts. How Potter died.",
    "So we can continue our work together?",
    "We can.",
    "For Voldemort and Valor."
  ],
  [
    "Hey, Scorpion King.",
    "Because we are ready to spill some proper Mudblood guts.",
    "Scorpius.",
    "Polly Chapman?",
    "Right.",
    "For Voldemort it is."
  ],
  [
    "You are late.",
    "This is your office?",
    "You are late and unapologetic, maybe you are determined to compound the problem.",
    "How dare you! How dare you embarrass me and keep me waiting and then not apologize for",
    "Sorry.",
    "Sir.",
    "Sorry, sir.",
    "I did not bring you up to be sloppy, Scorpius. I did not bring you up to humiliate me at",
    "Humiliate you, sir?",
    "Harry Potter, asking questions about Harry Potter, of all the embarrassing things. How dare",
    "Scorpius . . .",
    "Be very careful.",
    "Do not use her name in vain, Scorpius. Do not score points that way. She deserves better than",
    "She made being brave very easy, your mother.",
    "The Malfoys. The family you can always rely on to make the world a murkier place.",
    "You know what I loved most about your mother? She could always help me find light in the",
    "Did she?",
    "Yes. Sir.",
    "For Voldemort and Valor.",
    "For Voldemort and Valor."
  ],
  [
    "Why are you here?",
    "I hate homework?",
    "Did he say Snape?"
  ],
  [
    "Did no one teach you to knock, boy?",
    "Severus Snape. This is an honor.",
    "Professor Snape will do fine. You may behave like a king at this school, Malfoy, but that",
    "I need your help.",
    "I exist to serve.",
    "There was a stolen Time-Turner. I stole a Time-Turner. With Albus. We tried to bring",
    "Harry Potter won that Triwizard Tournament.",
    "I can see this is a Malfoy game. Get out before I alert your father and plunge you into deep",
    "Harry Potter is dead.",
    "Colloportus!"
  ],
  [
    "You make one more move and your brain will be a frog and your arms will be rubber.",
    "I was an excellent student.",
    "I am, Hermione.",
    "Thank Dumbledore for that."
  ],
  [
    "Less wanted.",
    "To be clear",
    "Voldemort is dead. Killed in the Battle of Hogwarts. Harry is Head of Magical Law",
    "Brilliant. What do I do?",
    "Great. I expect their mother is hot.",
    "Well . . . Um . . . Depends what you think of . . . The thing is, you two sort of have",
    "Bravely.",
    "Who?",
    "Voldemort.",
    "How very irritating.",
    "Which spells did you use?",
    "Expelliarmus in the first task and Engorgio in the second.",
    "Simple Shield Charms should set both of those right.",
    "And then you left?",
    "And can you still only move in time, not space?",
    "Interesting.",
    "Sometimes costs are made to be borne."
  ],
  [
    "And Cedric Diggory has entered the stage. And he seems ready. Scared but ready. He",
    "This is taking too long. The Time-Turner is spinning.",
    "What has this young, brave, handsome man got up his sleevies now?"
  ],
  [
    "Ow. Ow. Owwwwwww.",
    "Ron . . . Ron . . . What has it done to you?",
    "Oh no. I knew it.",
    "The Time-Turner did something to Albus too. The first time we went back.",
    "Ron, you can still walk, come on . . .",
    "Did it work?",
    "We blocked the spell. Cedric kept his wand. Yes. It worked.",
    "Too late.",
    "This is a disaster.",
    "What?",
    "What?",
    "Can we talk about the love thing first?",
    "Go. We go.",
    "And a son. I liked that idea too.",
    "Kiss me.",
    "They just sucked out their souls.",
    "Think of something else, Scorpius. Occupy your thoughts.",
    "The world changes and we change with it. I am better off in this world. But the world is not",
    "Professor Snape!",
    "Professor Umbridge.",
    "With you. Granger was with you.",
    "Well . . .",
    "How long have you suspected?",
    "Years. And I should have acted upon it far earlier.",
    "Depulso!",
    "Thank you for being my light in the darkness.",
    "Whoa!",
    "Albus!",
    "You have no idea how good it is to see you again.",
    "You just saw me two minutes ago.",
    "A lot has happened since then.",
    "Did it work? Did we do anything?",
    "What? We failed.",
    "Scorpius. Have you been eating too many sweets again?",
    "Albus. Albus. Are you okay?",
    "Hello, Scorpius.",
    "And Myrtle told us everything.",
    "What is going on?",
    "Oh no. Oh bother. Where is it?",
    "Just returned from where?",
    "Time to cut the pretense, Albus."
  ],
  [
    "And your response to disappearing Hugo and Rose Granger-Weasley was to",
    "Yes, Professor.",
    "Yes.",
    "You may not. What you choose to do as parents is your matter but this is my",
    "Seems fair.",
    "What did I miss?",
    "It is considered polite to knock when entering a room, Hermione",
    "Ah.",
    "If I could also give a detention to you, Minister, I would. Keeping hold of a",
    "I know.",
    "Your intentions to save Cedric were",
    "A horrific world.",
    "Yes, Professor.",
    "Yes, Professor.",
    "Go on. Get out. The lot of you. And find me that Time-Turner."
  ],
  [
    "Thanks for letting me come up.",
    "Can you explain why you tried to do this?",
    "I know.",
    "If you were trying to do as I did, you went the wrong way about",
    "I know. Okay. I know.",
    "No.",
    "Really scared you?",
    "Yes.",
    "Is that how I make you feel?",
    "No.",
    "No. Nor me."
  ],
  [
    "Yes. You and I. Yes.",
    "I smell guilt, there is a stench of guilt upon the air.",
    "Get away. Get away from there.",
    "Do you still see with my eyes, Harry Potter?",
    "Dad . . . Dad . . ."
  ],
  [
    "Harry? Harry? What is it? You were screaming . . .",
    "Voldemort. I saw Voldemort and Albus.",
    "And Albus . . . ?",
    "Harry, is Albus still in danger?",
    "I think we all are."
  ],
  [
    "Albus . . . Psst . . . Albus.",
    "Good.",
    "When Rose came up to me today in Potions and called me Bread Head I almost hugged her.",
    "Apart from the Polly Chapman fancying you bits.",
    "But you changed things. You had a chance and you changed time back. Changed yourself back.",
    "Only because I knew what I should be.",
    "No. Not yet.",
    "We both went back, Albus.",
    "And why was I so determined to do this? Cedric? Really? No. I had something to prove. My",
    "Yes. I do. I do know that.",
    "Good. Then you can help me destroy this.",
    "Turns out Malfoy the Unanxious is a pretty good liar.",
    "Scorpius . . . We should tell someone about this . . .",
    "Who? The Ministry kept it before, do you really trust them not to keep it again? Only you",
    "Been working on it all day."
  ],
  [
    "I need to find my son.",
    "You got our message? Good.",
    "Yes.",
    "And young Malfoy?",
    "Oh no.",
    "Something feels even worse this time.",
    "You spoke to him earlier?",
    "Yes.",
    "You came to his dorm and talked to him?",
    "You know I did.",
    "What did you say to our son, Harry?",
    "And you controlled yourself? How heated did it get?",
    "I can forgive you for one mistake, Harry, maybe even two, but the more mistakes you make,"
  ],
  [
    "So I think a simple Confringo.",
    "Definitely not. For something like this you need Expulso.",
    "Bombarda?",
    "And wake up everyone in Hogwarts? Maybe Stupefy. They were originally destroyed using",
    "Fun? Look, many wizards overlook the importance of choosing the right spell, but this",
    "Your owl said so little . . .",
    "Imagine the worst possible world, and then double it. People being tortured, dementors",
    "Voldemort ruled? He was alive?",
    "He ruled everything. It was terrible.",
    "Because of what we did?",
    "Humiliating Cedric turned him into a very angry young man, and then he became a Death",
    "A Death Eater?",
    "And a murderer. He killed Professor Longbottom.",
    "You understand?",
    "Thank you.",
    "What?",
    "An Augurey?",
    "Your . . . guardian?",
    "She used to say it was crying because it could see I was going to come to a sticky end. She",
    "Why would you want a tattoo of her bird, then?",
    "It reminds me that the future is mine to make.",
    "Cool. I might get an Augurey tattoo.",
    "The Rowles were pretty extreme Death Eaters.",
    "Give it back. Give us back the Time-Turner.",
    "What?",
    "Scorpius? What are you doing?",
    "The Augurey? I rather like that.",
    "Delphi?",
    "Fulgari!",
    "Albus. Run!",
    "Fulgari!",
    "But why? But what? But who are you?",
    "Albus. I am the new past."
  ],
  [
    "If this is your way of saying you want a marital break, Ron, then, to be clear, I will skewer",
    "You want to marry me again?",
    "And you taste of toffee . . .",
    "And Albus is missing. Again.",
    "Where?",
    "Ron, if you could get to the point before we all strangle you?",
    "An older girlfriend?",
    "This is about Cedric again?",
    "Ethel! Cancel the goblins."
  ],
  [
    "Where are they?",
    "Harry Potter, and what can I do for you, sir? And Draco Malfoy. I am blessed.",
    "But why would I know where they are?",
    "I have no idea what you are . . . (He stops, a beat, confused.) My niece?",
    "Yes, you do, a nurse, works here. Your niece . . . Delphini Diggory."
  ],
  [
    "What are we doing on the Quidditch pitch?",
    "Yes, it is time to spare the spare once and for all. We will go back for Cedric and in doing so",
    "Hell. You want to resurrect hell?",
    "I want a return to pure and strong magic. I want to rebirth the Dark.",
    "Of course you will.",
    "No. To fulfill the prophecy, this has to be you, not a puppet of you. You have to be the one to",
    "Do your worst.",
    "I will.",
    "No!",
    "Crucio!",
    "I will . . .",
    "What? What on earth do you think you can do? A wizardwide disappointment? A",
    "Stop. Please.",
    "Craig. Get away. Get help!",
    "Avada Kedavra!",
    "Then will the"
  ],
  [
    "Where is he? Where is Cedric?",
    "The hedges want to kill us too? This gets better and better.",
    "You will keep up or face the consequences.",
    "The perils are plentiful, but the prizes are palpable. Who will fight their way through?",
    "Albus, we need to do something.",
    "Are you?",
    "The flaw in the Time-Turner, the five-minute rule. We do all we can to run down",
    "Where did she go?",
    "Does it matter? Which way do you think?",
    "You poor creatures.",
    "You think you can fight me?",
    "No. But we can defy you. If we lay down our lives to do so.",
    "The prophecy must be fulfilled. We will fulfill it.",
    "Prophecies can be broken.",
    "But if the prophecy is inevitable why are we here trying to influence it? Your actions",
    "You talk too much, child. Crucio!",
    "Scorpius!",
    "Then you will die.",
    "Expelliarmus!",
    "a young, good-looking lad of seventeen or so, CEDRIC.",
    "Come no further.",
    "Cedric Diggory. I heard screaming, I had to come. Name yourselves, beasts. I can fight you.",
    "Cedric?",
    "You saved us.",
    "Are you also a task? An obstacle? Speak. Do I have to defeat you too?",
    "Emancipare! Emancipare!",
    "Then I shall.",
    "What?",
    "Just thought you should know that.",
    "Okay. Um. Thank you.",
    "Albus.",
    "No. Wait . . .",
    "What have we done?",
    "We had to go with the Time-Turner, we had to try to stop her.",
    "Hogwarts looks the same.",
    "We need to stop her, Scorpius."
  ],
  [
    "It must have been a Confundus Charm she used on him. Used on them all. She faked being a",
    "Specialis Revelio!",
    "These panels, these panels must conceal something.",
    "Or the bed does.",
    "What you hiding? What you got?",
    "And what does it say?",
    "And nor has your scar hurt.",
    "Then do it.",
    "A prophecy. A new prophecy.",
    "She must do.",
    "But why does she need Scorpius or Albus?",
    "Who is she? To be so obsessed with all this?",
    "Voldemort had a daughter?",
    "No, no, no. Not that. Anything but that."
  ],
  [
    "She? A daughter? He had a daughter?",
    "Yes. A daughter.",
    "And is she now in custody?",
    "Professor, she did ask for no questions.",
    "Of all the reckless stupid things, you kept the Time-Turner even now?",
    "Shame on you, Hermione Granger.",
    "Whether our son gave it her. Or whether it was stolen from him.",
    "And if she succeeds?"
  ],
  [
    "Hello, Mr. Stationmaster. Mr. Muggle. Question",
    "You know what annoys me most of all? Dad will think we did it deliberately.",
    "Sorry?",
    "I know where she is.",
    "You understood that?",
    "Look at the date. On the timetable.",
    "The death of my grandparents. The attack on my dad as a baby . . . The moment when",
    "The big one?"
  ],
  [
    "No, he tried to a few times but I refused.",
    "My dad has a statue?",
    "The Bathilda Bagshot? A History of Magic Bathilda Bagshot?",
    "Scorpius!",
    "The home of James, Lily, and Harry Potter . . ."
  ],
  [
    "Good evening, Harry.",
    "What are you doing?",
    "Here just as the battle is lost. Or are you denying that Voldemort is going to return.",
    "Protecting yourself, even then!",
    "No. I was protecting you. I did not want to hurt you . . .",
    "You would have hurt me less if you had told me this then.",
    "Harry, there is never a perfect answer in this messy, emotional world. Perfection is",
    "the knowledge that pain will come again. Be honest to those you",
    "You said that to me once before.",
    "It is all I have to offer you tonight.",
    "Those that we love never truly leave us, Harry. There are things that death cannot touch.",
    "I loved you too, Dumbledore.",
    "I know.",
    "What did you want to do?",
    "Do you think Theodore Nott had the only Time-Turner?",
    "What?",
    "The Time-Turner the Ministry seized was a prototype. Made of inexpensive metal. It does the",
    "He was working for you?",
    "And did you keep it?",
    "Hermione Granger. It was the reason she kept the first, the fear that there might be a second.",
    "Scorpius.",
    "We were capable of having children but Astoria was frail. A blood malediction, a serious one.",
    "Astoria always knew that she was not destined for old age. She wanted me to have somebody",
    "Love blinds. We have both tried to give our sons, not what they needed, but what we needed.",
    "Which is why you need this. I have been holding on to it, barely resisting using it, even though"
  ],
  [
    "We tell my granddad and grandma?",
    "Can we risk him knowing your dad survives? That he has kids?",
    "Albus, there have been about a hundred books written on what Dumbledore knew, how he",
    "Only slightly.",
    "Help.",
    "So we hide in a hole?",
    "Well, it is a moderately cold day.",
    "Amongst other things, pearl dust.",
    "Dad and I had a fight on the day before I went to school.",
    "This I am aware of. I believe it kind of got us into this mess.",
    "I threw the blanket across the room. It collided with the love potion that Uncle Ron gave me as",
    "So?",
    "No. Still not getting you.",
    "What reacts with pearl dust?",
    "Well, it is said that if tincture of Demiguise and pearl dust meet . . . they burn.",
    "No.",
    "So if we were to get that blanket and write on it in tincture of Demiguise, then . . .",
    "Nothing would react to it until it came into contact with the love potion. In your",
    "We just need to work out where to find some . . . Demiguises.",
    "You know, rumor has it Bathilda Bagshot never saw the point in witches and wizards"
  ],
  [
    "Surprised to find you here.",
    "Harry, he was kidnapped by a powerful Dark witch, how can that be your fault?",
    "I chased him away. I chased him to her.",
    "Can we not treat this as if the battle is already lost?",
    "They were killed by Voldemort.",
    "The Boy Who Lived. How many people have to die for the Boy Who Lived?",
    "Albus wrote this?"
  ],
  [
    "Is it just me or are there more Muggles about . . .",
    "You remember when we were last here? This feels just like old times.",
    "Old times with a few unwelcome ponytails added to the mix.",
    "Malfoy, you may be all chummy chummy with Harry, and you may have produced a relatively",
    "Fine. But if you say one thing about her or me . . .",
    "So? Has it worked?"
  ],
  [
    "MUM?",
    "Albus Severus Potter. Are we pleased to see you.",
    "You got our note . . . ?",
    "We got your note.",
    "We can hug too if you like . . .",
    "You know about Delphi?",
    "Yes, we thought that might be it too. Do you know where specifically she is now?"
  ],
  [
    "Poor kid thought he had to save the world.",
    "Poor kid has saved the world. That blanket was masterful. I mean, he also almost destroyed the",
    "I remember.",
    "I do love him specifically, Ginny.",
    "I know, but he needs to feel it.",
    "We are running out of time.",
    "Because this is the day that everything changed . . .",
    "A year and three months.",
    "What?"
  ],
  [
    "Voldemort killing my grandparents. Voldemort trying to kill my dad?",
    "Blimey! There are two of them!",
    "So how can we use this to our advantage?",
    "Polyjuicing. And I think Bathilda Bagshot may have all the ingredients for Polyjuice in her",
    "But I like the concept, a pretend mouse for her cat.",
    "How close can we get through Transfiguration?",
    "You want to transfigure into Voldemort?",
    "Who are you calling intense?",
    "What?",
    "So could any of us. Your concerns are valid, but . . .",
    "Hang on, Hermione. Gin.",
    "Easy. He gets her in here. We zap her together.",
    "Harry, last chance, are you sure you can do this?",
    "Yes, I can do this.",
    "Wands.",
    "Bloody hell.",
    "It worked, then?",
    "Yes. It worked."
  ],
  [
    "This is all my fault.",
    "Dad . . .",
    "Whichever witch or wizard is following me, I assure you, you will regret it.",
    "Lord Voldemort. It is me. I am following you.",
    "I do not know you. Leave me.",
    "I am your daughter.",
    "I am from the future. The child of Bellatrix Lestrange and you. I was born in Malfoy Manor",
    "I am the Augurey to your Dark Lord, and I am ready to give all that I have to serve you.",
    "I have tried to follow the path you set.",
    "I see what you are, and I see what you could be. Daughter.",
    "Father?",
    "Together, the power we could wield.",
    "Father . . .",
    "Come here, in the light, so I may examine what my blood made.",
    "Your mission is a mistake. Attacking Harry Potter is a mistake. He will destroy you.",
    "He is a baby.",
    "Father?",
    "Your plan is a good one. The fight is off. You",
    "Father . . .",
    "Incendio!",
    "Potter. Colloportus!",
    "Harry . . . Harry . . .",
    "Dad . . .",
    "Albus! No!",
    "Alohomora! Alohomora!",
    "No . . . No . . .",
    "Brachiabindo!",
    "Albus, are you okay?",
    "He insisted. He was the only one small enough to crawl through the grate. I tried to stop him.",
    "I only wanted to know my father.",
    "Then kill me.",
    "No, Albus . . .",
    "We have to be better than them.",
    "Take my mind. Take my memory. Make me forget who I am.",
    "No. No. Not yet.",
    "What?",
    "Voldemort.",
    "Father?",
    "Now? Here?",
    "Father!",
    "Silencio! (DELPHI is gagged.) Wingardium Leviosa! (She is sent upwards and away.)"
  ],
  [
    "Dad, now is not the time . . .",
    "Avada Kedavra!",
    "He did everything he could.",
    "Not Harry, not Harry, please not Harry . . .",
    "Stand aside, you silly girl . . . Stand aside, now . . .",
    "Not Harry, please no, take me, kill me instead . . .",
    "Avada Kedavra!"
  ],
  [
    "James?"
  ],
  [
    "Rose Granger-Weasley. I asked out Rose Granger-Weasley.",
    "And she said no.",
    "But I asked her. I planted the acorn. The acorn that will grow into our eventual marriage.",
    "Correction, she used to hate me, but did you see the look in her eyes when I asked? That",
    "I admire your confidence.",
    "Hi.",
    "Received and entirely understood.",
    "I thought we hated Quidditch?",
    "A walk?",
    "Ha! Yeah. Right."
  ],
  [
    "So are you ready?",
    "For what?",
    "Good to know.",
    "Yes?",
    "And had he?",
    "Harry Potter is afraid of the dark?",
    "Nasty, pecky, dirty things. They give me the creeps.",
    "But pigeons are harmless!",
    "I know. But the thing that scares me most, Albus Severus Potter, is being a dad to you. Because",
    "James is nothing like me.",
    "Everything comes easy for James. My childhood was a constant struggle.",
    "I almost destroyed the world.",
    "They were good men.",
    "Dad? Why are we here?",
    "This is where I often come.",
    "But this is a graveyard . . .",
    "Dad?",
    "Not well enough.",
    "So do I."
  ]
]