{
  "conversations": [
    [
      "Dad. He keeps saying it.",
      "James, give it a rest.",
      "I only said he might be in Slytherin. And he might so . . . (Off his dad’s glare.) Fine.",
      "You’ll write to me, won’t you?",
      "Every day if you want us to.",
      "No. Not every day. James says most people only get letters from home about once a month. I",
      "We wrote to your brother three times a week last year.",
      "What? James!",
      "Yes. You may not want to believe everything he tells you about Hogwarts. He likes a laugh,",
      "Can we go now, please?",
      "All you have to do is walk straight at the wall between platforms nine and ten.",
      "I’m so excited.",
      "Don’t stop and don’t be scared you’ll crash into it, that’s very important. Best to do it at a run",
      "I’m ready."
    ],
    [
      "This is it.",
      "Wow!",
      "Platform nine and three-quarters.",
      "Where are they? Are they here? Maybe they didn’t come?",
      "If it isn’t my favorite Potter.",
      "Have you got my trick?",
      "Are you aware of the Weasleys’ Wizard Wheezes–certified nose-stealing breath?",
      "Mum! Dad’s doing that lame thing again.",
      "You say lame, he says glorious, I say — somewhere in between.",
      "Hang on. Let me just munch this . . . air. And now it’s just a simple matter of . . . Excuse me if I",
      "You smell of porridge.",
      "Bing. Bang. Boing. Young lady, get ready to not being able to smell at all . . .",
      "Where’s my nose?",
      "Ta-da!",
      "You are silly.",
      "Everyone’s staring at us again.",
      "Because of me! I’m extremely famous. My nose experiments are legendary!",
      "They’re certainly something.",
      "Parked all right, then?",
      "I did. Hermione didn’t believe I could pass a Muggle driving test, did you? She thought I’d have",
      "I thought nothing of the kind, I have complete faith in you.",
      "And I have complete faith he did Confund the examiner.",
      "Oi!",
      "Dad . . .",
      "And what would be wrong with that?",
      "Slytherin is the House of the snake, of Dark Magic . . . It’s not a House of brave wizards.",
      "Albus Severus, you were named after two headmasters of Hogwarts. One of them was a",
      "But just say . . .",
      "If it matters to you, you, the Sorting Hat will take your feelings into account.",
      "Really?",
      "It did for me.",
      "Apart from the Thestrals. Watch out for the Thestrals.",
      "I thought they were invisible!",
      "Listen to your professors, don’t listen to James, and remember to enjoy yourself. Now, if you",
      "I’m going to chase the train out.",
      "Lily, come straight back.",
      "Rose. Remember to send Neville our love.",
      "Mum, I can’t give a professor love!",
      "Okay, then. Bye.",
      "They’re going to be okay, right?",
      "Hogwarts is a big place.",
      "Big. Wonderful. Full of food. I’d give anything to be going back.",
      "Strange, Al being worried he’ll be sorted into Slytherin.",
      "That’s nothing, Rose is worried whether she’ll break the Quidditch scoring record in her",
      "I have no idea where she gets her ambition from.",
      "And how would you feel, Harry, if Al — if he is?",
      "You know, Gin, we always thought there was a chance you could be sorted into Slytherin.",
      "What?",
      "Honestly, Fred and George ran a book.",
      "Can we go? People are looking, you know.",
      "People always look when you three are together. And apart. People always look at you.",
      "Of course he will."
    ],
    [
      "Anything from the trolley, dears? Pumpkin Pasty? Chocolate Frog? Cauldron Cake?",
      "Al. We need to concentrate.",
      "Concentrate on what?",
      "On who we choose to be friends with. My mum and dad met your dad on their first Hogwarts",
      "So we need to choose now who to be friends with for life? That’s quite scary.",
      "On the contrary, it’s exciting. I’m a Granger-Weasley, you’re a Potter — everyone will want to",
      "So how do we decide — which compartment to go in . . .",
      "We rate them all and then we make a decision.",
      "Hi. Is this compartment . . .",
      "It’s free. It’s just me.",
      "Great. So we might just — come in — for a bit — if that’s okay?",
      "That’s okay. Hi.",
      "Albus. Al. I’m — my name is Albus . . .",
      "Hi Scorpius. I mean, I’m Scorpius. You’re Albus. I’m Scorpius. And you must be . . .",
      "Rose.",
      "Hi, Rose. Would you like some of my Fizzing Whizbees?",
      "I’ve just had breakfast, thanks.",
      "I’ve also got some Shock-o-Choc, Pepper Imps, and some Jelly Slugs. Mum’s idea — she",
      "I’ll have some . . . Mum doesn’t let me have sweets. Which one would you start with?",
      "Easy. I’ve always regarded the Pepper Imp as the king of the confectionery bag. They’re",
      "Brilliant, then that’s what I’ll — (ROSE hits him again.) Rose, will you please stop hitting me?",
      "I’m not hitting you.",
      "You are hitting me, and it hurts.",
      "She’s hitting you because of me.",
      "What?",
      "Listen, I know who you are, so it’s probably only fair you know who I am.",
      "What do you mean you know who I am?",
      "You’re Albus Potter. She’s Rose Granger-Weasley. And I am Scorpius Malfoy. My parents",
      "That’s putting it mildly. Your mum and dad are Death Eaters!",
      "Dad was — but Mum wasn’t.",
      "What — is the rumor?",
      "The rumor is that my parents couldn’t have children. That my father and my grandfather",
      "To send her back where?",
      "The rumor is that he’s Voldemort’s son, Albus.",
      "And it’s just like my father ’s! I got his nose, his hair, and his name. Not that that’s a great",
      "Yes, well, we probably should sit somewhere else. Come on, Albus.",
      "No. (Off ROSE’s look.) I’m okay. You go on . . .",
      "Albus. I won’t wait.",
      "And I wouldn’t expect you to. But I’m staying here.",
      "Fine!",
      "Thank you.",
      "No. No. I didn’t stay — for you — I stayed for your sweets.",
      "She’s quite fierce.",
      "Yes. Sorry.",
      "No. I like it. Do you prefer Albus or Al?",
      "Albus.",
      "THANK YOU FOR STAYING FOR MY SWEETS,",
      "Wow."
    ],
    [
      "Albus Potter.",
      "A Potter. In our year.",
      "He’s got his hair. He’s got hair just like him.",
      "And he’s my cousin. (As they turn.) Rose Granger-Weasley. Nice to meet you.",
      "Thank Dumbledore.",
      "Scorpius Malfoy.",
      "Well, that makes sense.",
      "Albus Potter.",
      "Slytherin?",
      "Whoa! A Potter? In Slytherin.",
      "You can stand next to me!",
      "Right. Yes.",
      "I suppose his hair isn’t that similar.",
      "Albus? But this is wrong, Albus. This is not how it’s supposed to be.",
      "Well, what are you all waiting for? Everyone stand by a broomstick. Come on, hurry",
      "UP!",
      "Yes!",
      "Come on, now, I’ve no time for shirkers. Say “UP.” “UP” like you mean it.",
      "UP!",
      "YES!",
      "Up. UP. UP.",
      "Oh Merlin’s beard, how humiliating! He really isn’t like his father at all, is he?",
      "Albus Potter, the Slytherin Squib.",
      "Okay. Children. Time to fly.",
      "I’m just asking you, Dad, if you’ll — if you’ll just stand a little away from me.",
      "Second-years don’t like to be seen with their dads, is that it?",
      "No. It’s just — you’re you and — and I’m me and —",
      "It’s just people looking, okay? People look. And they’re looking at me, not you.",
      "At Harry Potter and his disappointing son.",
      "What does that mean?",
      "At Harry Potter and his Slytherin son.",
      "Slythering Slytherin, stop with your dithering, time to get onto the train.",
      "Unnecessary, James.",
      "See you at Christmas, Dad.",
      "Al —",
      "My name is Albus, not Al.",
      "Are the other kids being unkind? Is that it? Maybe if you tried making a few more friends . . .",
      "But I don’t need a Ron and Hermione. I’ve — I’ve got a friend, Scorpius, and I know you don’t",
      "Look, as long as you’re happy, that’s all that matters to me.",
      "You didn’t need to bring me to the station, Dad.",
      "But I wanted to be here . . .",
      "I need a favor.",
      "Draco.",
      "These rumors — about my son’s parentage — they don’t seem to be going away. The other",
      "Draco, just let it blow over — they’ll soon move on.",
      "My son is suffering and — Astoria hasn’t been well recently — so he needs all the support he",
      "If you answer the gossip, you feed the gossip. There’ve been rumors Voldemort had a child",
      "As soon as the train leaves you don’t have to talk to me.",
      "I know. We just need to keep the pretense up in front of the grown-ups.",
      "Hi, Rose.",
      "Bye, Albus.",
      "She’s melting.",
      "And I’m pleased to announce Gryffindor ’s newest member of the Quidditch",
      "Are you clapping her too? We hate Quidditch and she’s playing for another House.",
      "She’s your cousin, Albus.",
      "Do you think she’d clap for me?",
      "I think she’s brilliant.",
      "Albus Potter. An irrelevance. Even portraits turn the other way when he comes up the",
      "And now we add — is it horn of bicorn?",
      "Leave him and Voldemort’s child to it, I say.",
      "With just a little salamander blood . . .",
      "Okay. What’s the counter-ingredient? What do we need to change?",
      "Everything.",
      "Third year. Big year. Here is your permission form for Hogsmeade.",
      "I hate Hogsmeade.",
      "How can you hate a place you haven’t actually visited yet?",
      "Because I know it’ll be full of Hogwarts students.",
      "Just give it a go — come on — this is your chance to go nuts in Honeydukes without your",
      "Incendio!",
      "Of all the stupid things!",
      "The ironic thing is I didn’t expect it to work. I’m terrible at that spell.",
      "Al—Albus, I’ve been exchanging owls with Professor McGonagall — she says you’re",
      "So what would you like me to do? Magic myself popular? Conjure myself into a new House?",
      "It’s got the worst it can possibly get.",
      "I thought you’d send an owl . . .",
      "I couldn’t work out what to say.",
      "And now I don’t know what to say . . .",
      "Say nothing.",
      "Is there anything . . . ?",
      "Come to the funeral.",
      "Of course.",
      "And be my good friend.",
      "Yes!",
      "Great.",
      "Did you really think she’d come to us? Potters don’t belong in Slytherin.",
      "This one does."
    ],
    [
      "How did it go?",
      "It was true.",
      "Theodore Nott?",
      "In custody.",
      "And the Time-Turner itself?",
      "We don’t know anything yet. I wanted to try it out there and then but wiser heads prevailed.",
      "Well, now we have it.",
      "And you’re sure you want to keep it?",
      "I don’t think we’ve a choice. Look at it. It’s entirely different to the Time-Turner I had.",
      "Apparently wizardry has moved on since we were kids.",
      "You’re bleeding.",
      "What you doing in my office, Hermione?",
      "I was anxious to hear about Theodore Nott and — thought I’d check whether you’d kept",
      "Ah. Turns out I’m not.",
      "No. You’re not. Harry, how can you get any work done in this chaos?",
      "No longer chaotic.",
      "But still ignored. You know, there’s some interesting stuff in here . . . There are mountain",
      "Great, let’s get out there. I’ll get the team together.",
      "Harry, I get it. Paperwork’s boring . . .",
      "Not for you.",
      "I’m busy enough with my own. These are people and beasts that fought alongside",
      "But I don’t need to read it — I’m out there, hearing about it. Theodore Nott — it was me who",
      "Do you fancy a toffee? Don’t tell Ron.",
      "You’re changing the subject.",
      "I truly am. Toffee?",
      "Can’t. We’re off sugar at the moment. (Beat.) You know, you can get addicted to that stuff?",
      "What can I say? My parents were dentists, I was bound to rebel at some point. Forty is",
      "It seems I’m as good at fatherhood as I am at paperwork. How’s Rose? How’s Hugo?",
      "You know, Ron says he thinks I see more of my secretary, Ethel, (she",
      "You really think this could all mean something?",
      "It could do. But if it does, we’ll find a way to fight it, Harry. We always have.",
      "Farewell, Harry Potter."
    ],
    [
      "Amos, I understand, I really do — but I’m only just home and —",
      "I’ve tried to make appointments at the Ministry. They say, “Ah, Mr. Diggory, we have an",
      "—and coming to my house in the middle of the night — when my kids are just getting ready",
      "Two months pass, I receive an owl, “Mr. Diggory, I’m awfully sorry, but Mr. Potter has been",
      "Of course I’m not. It’s just, I’m afraid, as Head of the Department of Magical Law",
      "There’s plenty you’re responsible for.",
      "Sorry?",
      "My son, Cedric, you do remember Cedric, don’t you?",
      "Yes, I remember your son. His loss —",
      "Voldemort wanted you! Not my son! You told me yourself, the words he said were, “Kill the",
      "Mr. Diggory, as you know, I sympathize with your efforts to memorialize Cedric, but —",
      "A memorial? I am not interested in a memorial — not anymore. I am an old man — an old",
      "Get him back? Amos, that’s not possible.",
      "The Ministry has a Time-Turner, does it not?",
      "The Time-Turners were all destroyed.",
      "The reason I’m here with such urgency is I’ve just heard rumor — strong rumor — that the",
      "Amos, playing with time? You know we can’t do that.",
      "How many people have died for the Boy Who Lived? I’m asking you to save one of them.",
      "Whatever you’ve heard, the Theodore Nott story is a fiction, Amos, I’m sorry.",
      "Hello.",
      "Who are you? Because this is sort of my house and . . .",
      "I’m a thief, of course. I’m about to steal everything you own. Give me your gold, your wand,",
      "Albus.",
      "Of course! Albus Potter! So Harry is your dad? That’s a bit wow, isn’t it?",
      "Not really.",
      "Ah. Have I just put my foot in it? It’s what they used to say about me at school. Delphini",
      "They do all sorts with my name too.",
      "Delphi.",
      "We don’t choose who we’re related to. Amos . . . isn’t just my patient, he’s my uncle, it’s part",
      "Delphi!",
      "Upper Flagley?",
      "St. Oswald’s Home for Old Witches and Wizards. Come see us sometime. If you like.",
      "DELPHI!",
      "Yes, Uncle?",
      "Meet the once-great Harry Potter, now a stone-cold Ministry man. I will leave you in peace, sir.",
      "Yes, Uncle."
    ],
    [
      "James, please, ignore your hair, and tidy that damn room . . .",
      "How can I ignore it? It’s pink! I’m going to have to use my Invisibility Cloak!",
      "That’s not why your dad gave you that Cloak!",
      "Who’s seen my Potions book?",
      "Lily Potter, don’t think you’re wearing those to school tomorrow . . .",
      "I love them. They’re fluttery.",
      "Hi.",
      "Okay. A love potion. Okay.",
      "I think it’s a joke about — I don’t know what. Lily got farting gnomes, James got a comb that’s",
      "An old blanket?",
      "I thought a lot about what to give you this year. James — well, James has been going on about",
      "Wanted to hold it too? Okay. Done. Let’s hope it brings me luck. I certainly need some.",
      "I think — believe — Petunia wanted me to have it, that’s why she kept it, and now I want you to",
      "Listen, I’ve got quite a lot of packing to do, and you undoubtedly have Ministry work coming",
      "Albus, I want you to have the blanket.",
      "And do what with it? Fairy wings make sense, Dad, invisibility cloaks, they also make sense —",
      "Do you want a hand? Packing. I always loved packing. It meant I was leaving Privet Drive and",
      "For you, it’s the greatest place on earth. I know. The poor orphan, bullied by his uncle and aunt",
      "Albus, please — can we just —",
      ". . . traumatized by his cousin, Dudley, saved by Hogwarts. I know it all, Dad. Blah, blah, blah.",
      "I’m not going to rise to your bait, Albus Potter.",
      "The poor orphan who went on to save us all. So may I say — on behalf of wizarding kind —",
      "Albus, please — you know, I’ve never wanted gratitude.",
      "But right now I’m overflowing with it — it must be the kind gift of this moldy blanket that did",
      "Moldy blanket?",
      "What did you think would happen? We’d hug. I’d tell you I always loved you. What? What?",
      "You know what? I’m done with being made responsible for your",
      "And you think that was unlucky? I don’t.",
      "You wish me dead?",
      "No! I just wish you weren’t my dad.",
      "Well, there are times I wish you weren’t my son.",
      "Yes. You did.",
      "Albus, you just know how to get under my skin . . .",
      "You meant it, Dad. And, honestly, I don’t blame you.",
      "Albus, please . . .",
      "No luck or love for me, then.",
      "Albus. Albus . . . Please . . ."
    ],
    [
      "Mum, I don’t like this.",
      "I knew we made a mistake coming here. Vernon. Vernon. There’s nowhere we can hide.",
      "Hold on. Hold on. Whatever it is, it’s not coming in here.",
      "We’re cursed! He’s cursed us! The boy has cursed us! (Seeing YOUNG HARRY.) This is all",
      "Whoever ’s there, I should warn you — I’m armed.",
      "Couldn’t make us a cup o’ tea, could yeh? It’s not been an easy journey.",
      "Look. At. Him.",
      "Stand back. Stand back. Behind me, Petunia. Behind me, Dudley. I’ll soon see this",
      "Scarrawhat?",
      "Hello.",
      "Las’ time I saw yeh, yeh was only a baby. Yeh look a lot like yer dad, but yeh’ve got yer",
      "You knew my parents?",
      "Where’s me manners? A very happy birthday to yeh. Got summat fer yeh here — I mighta sat",
      "Who are you?",
      "True, I haven’t introduced meself. Rubeus Hagrid, Keeper of Keys and Grounds at",
      "Hogwhere?",
      "Hogwarts. Yeh’ll know all about Hogwarts, o’ course.",
      "Er — no. Sorry.",
      "Sorry? It’s them as should be sorry! I knew yeh weren’t gettin’ yer letters but I never thought",
      "Learnt what?",
      "Do you mean ter tell me, that this boy — this boy! — knows nothin’ abou’ — about",
      "I forbid you to tell the boy anything more!",
      "Tell me what?",
      "Harry — yer a wizard — yeh changed everything. Yer the most famous wizard in the whole"
    ],
    [
      "Harry . . .",
      "It’s fine. Go back to sleep.",
      "Lumos.",
      "Yes.",
      "About what?",
      "The Dursleys — well, it started there — then it became something else.",
      "Do you want a Sleeping Draught?",
      "No. I’ll be fine. Go back to sleep.",
      "You don’t seem fine.",
      "The anger I can cope with, the fact he’s right is harder. Amos lost his son because of me —",
      "That doesn’t seem particularly fair on yourself . . .",
      "— and there’s nothing I can say — nothing I can say to anyone — unless it’s the wrong thing,",
      "So that’s what’s upsetting you? The night before Hogwarts, it’s never a good night if you don’t",
      "It went pretty badly wrong from there. I said some things, Ginny . . .",
      "I heard.",
      "And you’re still talking to me?",
      "Because I know that when the time is right you’ll say sorry. That you didn’t mean it. That what",
      "I just wish he was more like James or Lily.",
      "Yeah, maybe don’t be that honest.",
      "No, I wouldn’t change a thing about him . . . but I can understand them, and . . .",
      "Albus is different and isn’t that a good thing. And he can tell, you know, when you’re putting",
      "“The truth is a beautiful and terrible thing, and should therefore be treated with great caution.”",
      "A strange thing to say to a child.",
      "Not when you believe that child will have to die to save the world.",
      "Harry. What’s wrong?",
      "Fine. I’m fine. I hear you. I’ll try to be —",
      "Does your scar hurt?",
      "No. No. I’m fine. Now, Nox that and let’s get some sleep.",
      "Harry. How long has it been since your scar hurt?",
      "Twenty-two years."
    ],
    [
      "Albus, I’ve been looking for you . . .",
      "Me? Why?",
      "Albus, it’s the start of the fourth year, and so the start of a new year for us. I want to be friends",
      "We never were friends.",
      "That’s harsh! You were my best friend when I was six!",
      "That was a long time ago.",
      "Have you heard the rumors? Big Ministry raid a few days ago. Your dad apparently was",
      "How do you always know about these things and I don’t?",
      "Apparently he — the wizard they raided — Theodore Nott, I think — had all sorts of artifacts",
      "A Time-Turner? Dad found a Time-Turner?",
      "Shh! Yes. I know. Great, right?",
      "You’re sure.",
      "Entirely.",
      "Now I have to find Scorpius.",
      "Albus!",
      "Who’s told you that you have to talk to me?",
      "Okay, maybe your mum owled my dad — but only because she’s worried about you.",
      "Leave me alone, Rose.",
      "Albus! Oh hello, Rose, what do you smell of?",
      "What do I smell of?",
      "No, I meant it as a nice thing, you smell like a mixture of fresh flowers and fresh — bread.",
      "Albus, I’m here, okay? If you need me.",
      "I mean, nice bread, good bread, bread . . . what’s wrong with bread?",
      "What’s wrong with bread!",
      "I’ve been looking for you everywhere . . .",
      "And now you’ve found me. Ta-da! I was hardly hiding. You know how I like to — get on",
      "Just a slightly weird twenty-four hours.",
      "What’s happened in them?",
      "I’ll explain later. We have to get off this train.",
      "Too late. The train is moving. Hogwarts ahoy!",
      "Then we have to get off a moving train.",
      "Anything from the trolley, dears?",
      "A moving magical train.",
      "Pumpkin Pasty? Cauldron Cake?",
      "Albus Severus Potter, get that strange look out of your eye.",
      "First question. What do you know about the Triwizard Tournament?",
      "Ooooh, a quiz! Three schools pick three champions to compete in three tasks for",
      "You really are an enormous geek, you know that?",
      "Ya-huh.",
      "Second question. Why has the Triwizard Tournament not been run in over twenty years?",
      "The last competition included your dad and a boy called Cedric Diggory — they decided to",
      "Good. Third question",
      "Albus, for obvious reasons, I’m not a massive fan of Time-Turners . . .",
      "When Amos Diggory asked for the Time-Turner my father denied they even existed. He lied to",
      "Okay, whatever was holding your brain together seems to have snapped.",
      "I’m going to do this, Scorpius. I need to do this. And you know as well as I do, I’ll entirely"
    ],
    [
      "Okay, now we’re on the roof of a train, it’s fast, it’s scary, this has been great, I feel like I’ve",
      "As I calculate it we should be approaching the viaduct soon and then it’ll be a short hike to St.",
      "The what? The where? Look, I am as excited as you are to be a rebel for the first time in my",
      "The water will be an extremely useful backup if our Cushioning Charm doesn’t work.",
      "Albus. The Trolley Witch.",
      "You want a snack for the journey?",
      "No. Albus. The Trolley Witch is coming towards us.",
      "No, she can’t be, we’re on top of the train . . .",
      "Anything from the trolley, dears? Pumpkin Pasty? Chocolate Frog? Cauldron Cake?",
      "Oh.",
      "People don’t know much about me. They buy my Cauldron Cakes — but they never",
      "What is your name?",
      "I’ve forgotten. All I can tell you is that when the Hogwarts Express first came to be —",
      "That’s — one hundred and ninety years. You’ve been doing this job for one hundred and",
      "These hands have made over six million Pumpkin Pasties. I’ve got quite good at them.",
      "You were right, Scorpius. This train is magical.",
      "At this precise moment in time, I take no pleasure in being right.",
      "But I was also right — about the viaduct — that’s water down there, time to try the Cushioning",
      "Albus, this is a bad idea.",
      "Is it? (He has a moment’s hesitation, then realizes the time for hesitation has passed.) Too late",
      "Albus . . . Albus . . ."
    ],
    [
      "Order. Order. Do I have to conjure silence? (She pulls silence from the crowd using her",
      "Voldemort’s allies have been showing movement for a few months now. We’ve followed trolls",
      "It did look like the potions stores had been interfered with when we returned",
      "Thank you, Professor. We shall investigate. (She looks around the room.) Nobody else?",
      "Voldemort is dead, Voldemort is gone.",
      "Yes, Draco, Voldemort is dead, but these things all lead us to think that there is a possibility",
      "Now this is difficult but we have to ask it to rule it out. Those of you with a Dark Mark . . . have",
      "Back to being prejudiced against those with a Dark Mark, are we, Potter?",
      "No, Draco. Harry is simply trying to —",
      "You know what this is about? Harry just wants his face back in the newspapers again. We’ve",
      "None of those rumors came from me!",
      "Really? Doesn’t your wife edit the Daily Prophet?",
      "The sports pages!",
      "Draco. Harry brought this matter to the attention of the Ministry. And I — as Minister for",
      "A vote you only won because you are his friend.",
      "Do you want a smack in the mouth?",
      "Face it — his celebrity impacts upon you all. And how better to get everyone whispering the",
      "Draco, no one is saying this has anything to do with Scorpius . . .",
      "Well, I, for one, think this meeting a sham. And I’m leaving.",
      "No. That’s not the way . . . Come back. We need a strategy."
    ],
    [
      "Um, excuse me . . . Excuse me. EXCUSE ME!",
      "Okay, so this place is wild.",
      "We’re looking for Amos Diggory.",
      "And what you boys want with that miserable old sod?",
      "Albus? Albus! You came? How wonderful! Come and say hello to Amos!"
    ],
    [
      "So let me get this straight. You overhear a conversation — a conversation which was not meant",
      "My father lied to you — I know he did. They do have a Time-Turner.",
      "Of course they do. You can move along now.",
      "What? No. We’re here to help.",
      "Help? What use could a pair of undersized teenagers be for me?",
      "My father proved you don’t have to be grown-up to change the wizarding world.",
      "So I should allow you to get involved because you’re a Potter? Relying on your famous name,",
      "No!",
      "A Potter who is in Slytherin House — yes, I’ve read about you — and who brings a Malfoy",
      "But —",
      "Your information was obvious but the confirmation is useful. Your father did lie. Now leave.",
      "No, you need to listen to me, you said it yourself — how much",
      "Did you not hear me, boy? I see no reason to trust you. So go. Now. Before I",
      "Come on, mate, if there’s one thing we’re good at it’s knowing where we’re not wanted.",
      "I can think of one reason why you should trust them, Uncle.",
      "This is Cedric we’re talking about . . .",
      "And — didn’t you say yourself, having someone inside Hogwarts might be a massive",
      "Why? Why do you want to put yourself at risk? What’s in it for you?",
      "I know what it is to be the spare. Your son didn’t deserve to be killed, Mr. Diggory. We can",
      "My son — my son was the best thing that ever happened to me — and",
      "We’re deadly serious.",
      "This is going to be dangerous.",
      "We know.",
      "Do we?",
      "Delphi — perhaps if you were prepared to accompany them?",
      "If that would make you happy, Uncle.",
      "You do understand even getting the Time-Turner will risk your lives.",
      "We’re ready to put our lives at risk.",
      "Are we?",
      "I hope you have it in you."
    ],
    [
      "I’ve told Draco again and again — no one in the Ministry is saying anything about",
      "I wrote to him — after he lost Astoria — to ask if there’s anything we could do. I thought",
      "He’s obsessed.",
      "He’s a mess — a grieving mess.",
      "And I’m sorry for his loss but when he accuses Hermione of . . . Well . . . (He looks across at",
      "Her?",
      "The trolls could be going to a party, the giants to a wedding, you could be getting bad dreams",
      "Getting old? Thanks, mate.",
      "Honestly, every time I sit down now I make an “ooof” noise. An “ooof.” And my feet — the",
      "You talk a lot of rubbish.",
      "I consider it my speciality. That and my range of Skiving Snackboxes. And my love for all of",
      "If you don’t behave, Ronald Weasley, I will tell Mum.",
      "You wouldn’t.",
      "If some part of Voldemort survived, in whatever form, we need to be prepared. And I’m",
      "I’m scared too.",
      "Nothing scares me. Apart from Mum.",
      "I mean it, Harry, I will not be Cornelius Fudge on this one. I will not stick my head in the",
      "You never really were one for popularity, were you?",
      "Bit late for an owl, isn’t it?",
      "It’s from Professor McGonagall.",
      "What does it say?",
      "Ginny, it’s Albus — Albus and Scorpius — they never made it to school. They’re missing."
    ],
    [
      "So we just take it?",
      "Scorpius, do I really need to explain to you — übergeek and Potions expert — what Polyjuice",
      "Okay, two points, one, is it painful?",
      "Very — as I understand it.",
      "Thank you. Good to know. Second point",
      "Consider us warned. (She knocks back the potion.) It doesn’t taste of fish. (She begins to",
      "Okay, that’s — wow.",
      "Double wow.",
      "This really doesn’t feel how I — I even sound like her! Triple wow.",
      "Right. Me next.",
      "No. No way, José. If we’re doing this, we’re doing it (he puts on a pair of familiar-looking",
      "Three. Two. One.",
      "This is going to be slightly weird, isn’t it?",
      "Go to your room. Go straight to your",
      "Scorpius . . .",
      "It was your idea — I be him and you be Ron! I",
      "You know, he hides it well, but Uncle Ron’s got a bit of a gut growing.",
      "We should go — don’t you think?",
      "Welcome, Harry Potter. Welcome, Hermione Granger. Welcome, Ron Weasley."
    ],
    [
      "Have we searched thoroughly beside the tracks . . .",
      "My department have searched once and are searching again.",
      "And the Trolley Witch is not able to tell us anything useful?",
      "The Trolley Witch is furious. She keeps talking about letting down Ottaline Gambol. She",
      "Have there been any instances of magic reported by the Muggles?",
      "None so far. I have made the Muggle Prime Minister aware and he is filing what is known",
      "So now we’re relying on Muggles to find our children? Have we told them about Harry’s scar",
      "We’re merely asking the Muggles to help. And who knows how Harry’s scar might be",
      "This is not Death Eater–related.",
      "I’m not sure I share your confidence.",
      "I’m not confident, I’m right. The sort of cretins pursuing Dark Magic now . . . My son is a",
      "Unless there’s something new out there, something to —",
      "I agree with Draco. If this is a kidnap — taking Albus I understand, taking them both . . .",
      "And Scorpius is a follower, not a leader, despite everything I’ve tried to instill in him. So it’s",
      "Harry, they’ve run away, you and I know it.",
      "Do you? Know it? What aren’t you telling us?",
      "Albus and I had an argument, the day before last.",
      "And . . .",
      "And I told him that there were times when I wished he weren’t my son.",
      "If anything happens to Scorpius . . .",
      "Don’t throw around threats, Draco, please don’t do that.",
      "My son is missing!",
      "So is mine!",
      "If you need gold . . . Everything the Malfoys have . . . He’s",
      "The Ministry has plenty in reserve, thank you, Draco.",
      "I don’t care what you did or who you saved, you are a constant curse on my family, Harry"
    ],
    [
      "And you’re sure it’s in there?",
      "Minister.",
      "Let’s ponder it together.",
      "Harry . . . we should talk about it . . .",
      "There’s nothing to talk about.",
      "Oh no.",
      "Hermione. And Dad.",
      "Okay. Hiding places. No hiding places. Anyone know any Invisibility Charms?",
      "Do we go . . . in her office?",
      "She’ll be coming to her office.",
      "There’s nowhere else.",
      "If you don’t talk to me or Ginny about it . . .",
      "Stand back. Alohomora!",
      "What is there to say?",
      "Me. Why?",
      "Well, it can’t be either of us, can it? We are them.",
      "What you said was obviously wrong — but — there are more factors at play",
      "But I can’t . . . I can’t . . .",
      "Hermione, I’m grateful for your concern but there’s no need —",
      "Ron?",
      "Surprise!!!",
      "What are you doing here?",
      "Does a man need an excuse to see his wife?",
      "I should go . . .",
      "Harry. My point is . . . whatever Draco says — the things you said to Albus . . . I don’t think",
      "Oh, you’re talking about how Harry said sometimes he wished I — (he corrects himself)",
      "Ron!",
      "Better out than in, that’s what I say . . .",
      "He’ll know . . . We all say stuff we don’t mean. He knows that.",
      "But what if sometimes we say stuff we do mean . . . What then?",
      "Ron, now’s not the time, honestly.",
      "Of course it isn’t. Bye-bye, darling.",
      "Why are you blocking the entrance to my office?",
      "I’m not. Blocking. Anything.",
      "You are. Let me into my room, Ron.",
      "Let’s have another baby.",
      "What?",
      "Or if not another baby, a holiday. I want a baby or a holiday and I’m going to insist on it.",
      "If there is another stink pellet in there then Merlin won’t help you. Fine. We’re",
      "It’s why you married me, isn’t it? My puckish sense of fun.",
      "I can taste fish. I told you to stay away from those fishfinger sandwiches.",
      "Right you are."
    ],
    [
      "This is all too weird.",
      "You were impressive. Good blocking action.",
      "I don’t know whether to high-five you or frown at you for kissing your aunt about",
      "Ron’s an affectionate guy. I was trying to distract her, Scorpius. I did distract her.",
      "And then there’s what your dad said . . .",
      "Boys . . . She will be back — we don’t have long.",
      "You heard that?",
      "Where would Hermione hide a Time-Turner? (She looks around the room, she sees",
      "Why didn’t you tell me?",
      "My dad says he wishes I weren’t his son. Hardly a conversation starter, is it?",
      "I know the — Voldemort thing isn’t — true — and — you know — but sometimes, I",
      "How did I produce this?",
      "Still better than my dad. I’m pretty sure he spends most of his time thinking",
      "Maybe if we could concentrate on the matter at hand.",
      "My point is, there’s a reason we’re friends, Albus — a reason we found each other,",
      "How to distract Scorpius from difficult emotional issues. Take him to a library.",
      "All the books from the Restricted Section and then some. Magick Moste Evile.",
      "Shadows and Spirits. The Nightshade Guide to Necromancy.",
      "They are quite something, aren’t they . . .",
      "The True History of the Opal Fire. The Imperius Curse and How to Abuse It.",
      "And lookee here. Whoa. My Eyes and How to See Past Them by Sybill Trelawney. A",
      "The first is the fourth, a disappointing mark.",
      "Okay. A book that talks. Bit weird.",
      "The second is the less fair of those that walk on two legs.",
      "It’s a riddle. It’s giving us a riddle.",
      "A turn in the city, a glide through a lake.",
      "What have you done?",
      "I, uh, I opened a book. Something which has — in all my years on this planet —",
      "What is that?",
      "She’s weaponized it. She’s weaponized her library. This is where the Time-Turner",
      "The first is the fourth. You’ll find it in parked, not in park. Ed — de —",
      "The second is a disease of the egg, the less fair of those who walk on two legs . . .",
      "Men! De-men . . . tors. We need to find a book on dementors. (The",
      "Delphi! What is going on?",
      "Concentrate, Albus. Do what she said. Find a book on dementors and be very careful.",
      "Here. Dominating Dementors",
      "I was born in a cage",
      "Voldemort.",
      "Work faster!",
      "Delphi! Delphi!",
      "She’d become herself again — did you notice?",
      "No! Because I was more worried about her being eaten by a bookcase! Find. Something.",
      "Albus? Albus!!",
      "The Truth, this must be . . .",
      "I am the creature you have not seen.",
      "Albus . . .",
      "No. Just — THIIIIIIINK.",
      "But I can’t . . . an invisible echo, what is that? The only thing I’m good at is thinking",
      "No! You don’t! Sybill Trelawney. No!!!!",
      "Delphi, are you . . . ?",
      "Wow. Quite a ride.",
      "Is that? Scorpius? What’s inside that book?",
      "I think we should find out, don’t you?",
      "We’ve found the Time-Turner — I never thought we’d get this far.",
      "Mate, now we’ve got this, the next stop is saving Cedric. Our journey has only just begun.",
      "Only just begun and it’s almost half killed us. Good. This is going to be good."
    ],
    [
      "Harry. Harry. These pots aren’t clean. THESE POTS ARE A DISGRACE. HARRY",
      "Aunt Petunia. What time is it?",
      "Time enough. You know, when we agreed to take you in, we hoped we could improve",
      "I try —",
      "Trying is not succeeding though, is it? There are grease smears on the glasses. There",
      "I’m — sorry, I think I was having a nightmare.",
      "You disgusting boy. Only animals wet themselves. Animals and disgusting little boys.",
      "It was about my mum and dad. I think I saw them — I think I saw them — die?",
      "And why would I have the slightest bit of interest in that?",
      "There was a man shouting Adkava Ad-something Acabra — Ad — and the noise of a",
      "If you were really reliving their death, all you’d hear would be a screech of brakes and"
    ],
    [
      "Lumos.",
      "Okay . . . ?",
      "I was sleeping.",
      "You were.",
      "You weren’t. Any — news? Any owls or . . . ?",
      "None.",
      "I was dreaming — I was under the stairs and then I — I heard him — Voldemort — so clearly.",
      "Voldemort?",
      "And then I saw — Albus. In red — he was wearing Durmstrang robes.",
      "Durmstrang robes?",
      "Ginny, I think I know where he is . . ."
    ],
    [
      "And we don’t know where in the Forbidden Forest?",
      "I haven’t had a dream like it for years. But Albus was there. I know he was.",
      "We need to get searching as quickly as possible.",
      "I can give you Professor Longbottom — his knowledge of plants might be",
      "Is it true? Can I help?",
      "Minister — this is quite unexpected . . .",
      "That may be my fault — I persuaded them to put out an emergency edition of the Daily",
      "Right. Very sensible. I expect . . . there will be quite a few.",
      "Have I missed anything — I couldn’t work out which Floo to travel to. Ended up in the kitchen",
      "Sorry about your floor, Minerva.",
      "I dare say it’s my fault for owning a chimney.",
      "Quite a surprise to see you, Draco. I thought you didn’t believe in my dreams.",
      "I don’t, but I do trust your luck. Harry Potter is always where the action is at. And I need my",
      "Then let’s get to the Forbidden Forest and find them both."
    ],
    [
      "Expelliarmus!",
      "You’re getting it now. You’re good at this.",
      "Expelliarmus!",
      "And we have a winner.",
      "I’ve never been good at spells.",
      "I was rubbish — and then something clicked. And it will for you too. Not that I’m a super",
      "Then you should stick around, teach me more . . .",
      "Of course I’m sticking around, we’re friends, aren’t we?",
      "Yes. Yes. Definitely friends. Definitely.",
      "Great. Wizzo!",
      "What’s wizzo?",
      "Cracked the spell. I mean, it’s pretty basic, but I was — well, I cracked it.",
      "And I’ve found our way through to the school. Listen,",
      "Yes!",
      "It’s a brilliant plan. The secret to not getting Cedric killed is to stop him winning the Triwizard",
      "And I understand that, but . . .",
      "So we just need to mess up his chances supremely badly in task one. The first task is getting a",
      "— by transfiguring a stone into a dog.",
      "— well, a little Expelliarmus and he won’t be able to do that.",
      "Okay, two points, first point, we’re certain the dragon won’t kill him?",
      "It’s always two points with him, isn’t it? Of course it won’t. This is Hogwarts. They won’t let",
      "Okay, second point — more significant point — we’re going back without any knowledge",
      "I’m sorry, Scorpius, we’ve no time to waste. Waiting here this close to the school is just too",
      "She’s right.",
      "Now, you’re going to need to wear these.",
      "But these are Durmstrang robes.",
      "My uncle’s idea. If you are in Hogwarts robes people will expect to know who you are. But",
      "Good thinking! Hang on, where are your robes?",
      "Albus, I’m flattered, but I don’t think I can pretend to be a student, do you? I’ll just keep in the",
      "You shouldn’t come.",
      "What?",
      "You’re right. We don’t need you for the spell. And if you can’t wear student robes — you’re",
      "But I have to — he’s my cousin. Albus?",
      "I think he’s right. I’m sorry.",
      "What?",
      "We won’t mess up.",
      "But without me — you won’t be able to work the Time-Turner.",
      "You taught us how to use the Time-Turner.",
      "No. I won’t let you do this . . .",
      "You told your uncle to trust us. Now it’s your turn. The school is close now. We should leave",
      "Then go. But — just know this . . . Today you get an opportunity few are given — today you",
      "She didn’t kiss me — did you notice? (He looks at his friend.) Are you okay, Albus? You",
      "Let’s do this."
    ],
    [
      "Albus? Scorpius? Albus?",
      "Harry Potter.",
      "Good. You still recognize me, Bane.",
      "You’ve grown older.",
      "I have.",
      "But not wiser. For you trespass on our land.",
      "I have always respected the centaurs. We are not enemies. You fought bravely at the Battle of",
      "I did my part. But for my herd, and our honor. Not for you. And after the battle, the forest was",
      "My son is missing, Bane. I need help finding him.",
      "And he is here? In our forest?",
      "Yes.",
      "Then he is as stupid as you are.",
      "Can you help me, Bane?",
      "I can only tell you what I know . . . But I tell you not for your benefit but for the benefit of my",
      "Neither do we! What do you know?",
      "I’ve seen your son, Harry Potter. Seen him in the movements of the stars.",
      "You’ve seen him in the stars?",
      "I can’t tell you where he is. I can’t tell you how you’ll find him.",
      "But you’ve seen something? You’ve divined something?",
      "There is a black cloud around your son, a dangerous black cloud.",
      "Around Albus?",
      "A black cloud that may endanger us all. You’ll find your son again, Harry Potter. But then you",
      "Albus! Albus!"
    ],
    [
      "And there it is . . .",
      "Hogwarts. Never seen this view of it before.",
      "Still get a tingle, don’t you? When you see it?",
      "And then you got there and it turned out to be terrible after all.",
      "Not for me.",
      "But I’m nothing like my dad.",
      "You’re better. You’re my best friend, Albus. And this is mayhem to the nth degree. Which is",
      "You’re my best friend too. And don’t worry — I have a good feeling about this.",
      "Albus? Albus.",
      "But we’ve got to go — now."
    ],
    [
      "Ladies and gentlemen — boys and girls — I give you — the greatest — the fabulous",
      "This has worked. That’s Ludo Bagman.",
      "And there they are. Ladies and gentlemen — boys and girls — I present to you — the",
      "Go, go, Krazy",
      "From the Beauxbatons Academy — zut alors, it’s Fleur Delacour!",
      "That’s my dad.",
      "Yes, it’s Harry Plucky Potter.",
      "If you’re going to stand so close I’d rather you didn’t breathe on me quite so much.",
      "Rose? What are you doing here?",
      "Who’s Rose? And what’s happened to your accent?",
      "Sorry. Hermione. He’s got you mixed up with someone else.",
      "How do you know my name?",
      "And with no time to lose let’s bring out our first champion — facing a Swedish Short-",
      "Don’t damage our",
      "Albus, something is going wrong. The Time-Turner, it’s shaking.",
      "And Cedric skirts left and he dives right — and he readies his wand — what has this",
      "Expelliarmus!",
      "— but no, what’s this? Is it Dark Magic or is it something else entirely? His wand is",
      "Albus, I think the Time-Turner — something is wrong . . .",
      "It’s all going wrong for Diggors. This could be the end of the task for him. The end of",
      "Albus! Did it hurt you? Albus, are you —",
      "What happened?",
      "There must be some limit — the Time-Turner must have some kind of time limit . . .",
      "Do you think we’ve done it? Do you think we’ve changed anything?",
      "I told you. I told you I saw them.",
      "I think we’re about to find out.",
      "Hello, Dad. Is something wrong?",
      "Yes. You could say that."
    ],
    [
      "Professor Dumbledore.",
      "Good evening, Harry.",
      "I’ve missed you. Whenever I’ve dropped in on the headmistress lately, your frame’s been",
      "Ah, well, I do like to pop into my other portraits now and then. (He looks at ALBUS .) Will",
      "He’s been out twenty-four hours, mostly in order so Madam Pomfrey could reset his arm. She",
      "A difficult thing, I imagine, to watch your child in pain.",
      "I’ve never asked how you felt about me naming him after you, have I?",
      "Candidly, Harry, it seemed a great weight to place upon the poor boy.",
      "I need your help. I need your advice. Bane says Albus is in danger. How do I protect my son,",
      "You ask me, of all people, how to protect a boy in terrible danger? We cannot protect",
      "So I’m supposed to stand and watch?",
      "No. You’re supposed to teach him how to meet life.",
      "How? He won’t listen.",
      "Perhaps he’s waiting for you to see him clearly.",
      "And what is the gossip about me and my son?",
      "Not gossip. Concern. That you two are struggling. That he’s difficult. That he is angry",
      "Blinded?",
      "You must see him as he is, Harry. You must look for what’s wounding him.",
      "Haven’t I seen him as he is? What’s wounding my son? (He thinks.) Or is it who’s wounding",
      "Dad . . .",
      "This black cloud, it’s someone, isn’t it? Not something?",
      "Ah really, what does my opinion matter anymore? I am paint and memory, Harry, paint",
      "But I need your advice.",
      "Dad?",
      "No, where have you gone now?",
      "We’re in — the hospital wing?",
      "Yes. And you’re — you will be fine. For recuperation, Madam Pomfrey",
      "Okay. I think.",
      "Much.",
      "It feels great.",
      "Where did you go, Albus? I can’t tell you what it did to us. Your mum was worried",
      "We decided we didn’t want to come to school. We thought we could start again — in the",
      "In Durmstrang robes?",
      "The robes were . . . The whole thing — Scorpius and I — we didn’t think.",
      "And why — why did you run? Because of me? Because of what I said?",
      "I don’t know. Hogwarts isn’t actually that pleasant a place when you don’t fit in.",
      "And did Scorpius — encourage you to — go?",
      "Scorpius? No.",
      "I need you to stay away from Scorpius Malfoy.",
      "What? Scorpius?",
      "I don’t know how you became friends in the first place, but you did, and now — I need you to",
      "My best friend? My only friend?",
      "He’s dangerous.",
      "Scorpius? Dangerous? Have you met him? Dad, if you honestly think he’s the son of",
      "I don’t know what he is, I just know you need to stay away from him. Bane told me —",
      "Who’s Bane?",
      "A centaur with profound Divination skills. He said there’s a black cloud around you and —",
      "A black cloud?",
      "And I have very good reason to believe that Dark Magic is in a resurgence and I need to keep",
      "And if I won’t? Stay away from him?",
      "There’s a map. It used to be used for those wanting to get up to no good. Now we’re going to",
      "You can’t make me go into Gryffindor! I’m Slytherin!",
      "Don’t play games, Albus, you know what House you are. If she finds you with Scorpius, I will",
      "But, Dad — you can’t — that’s just not . . .",
      "I thought for a long time I wasn’t a good enough dad for you because you didn’t like me. It’s"
    ],
    [
      "What if I run? I’ll run.",
      "Albus, get back in bed.",
      "I’ll run away again.",
      "No. You won’t.",
      "I will — and this time I’ll make sure Ron can’t find us.",
      "Do I hear my name?",
      "Uncle Ron! Thank Dumbledore. If ever we needed one of your jokes it’s now . . .",
      "Jokes? I don’t know any jokes.",
      "Of course you do. You run a joke shop.",
      "A joke shop? Well now. Anyway I’m pleased I caught you. I was going",
      "Who’s Padma?",
      "Your aunt.",
      "I have an Aunt Padma?",
      "Taken a Confundus Charm to the head, has he? (To ALBUS .) My wife, Padma. You",
      "But . . . you’re married to Hermione.",
      "Hermione. No. Nooooo. Merlin’s beard.",
      "Albus has also forgotten that he was sorted into Gryffindor. Conveniently.",
      "Yes, well, sorry, old chap, but you’re a Gryffindor.",
      "But how did I get sorted into Gryffindor?",
      "You persuaded the Sorting Hat, don’t you remember? Panju bet you that you couldn’t get into",
      "Who’s Panju?",
      "Bloody hell, you’re really not yourself, are you? Anyway, better go, before I’m sent a Howler",
      "But that doesn’t . . . make sense.",
      "Albus, whatever you’re feigning, it isn’t working. I will not change my mind.",
      "Dad, you have two choices, either you take me to —",
      "No, you’re the one with the choice, Albus. You do this, or you get in deeper, much deeper",
      "Albus? You’re okay. That’s fantastic.",
      "He’s completely cured. And we’ve got to go.",
      "Are you mad at me? What’s going on?",
      "Did it work? Did any of it work?",
      "No . . . But, Albus —",
      "Albus. Whatever gibberish you’re talking, you need to stop it, now. This is your final warning.",
      "I can’t, okay?",
      "You can’t what?",
      "Just — we’ll be better off without each other, okay?"
    ],
    [
      "I’m not sure this is what the Marauder ’s Map was intended for.",
      "If you see them together, then get to them as quickly as possible, and keep them separate.",
      "Harry, are you sure this is the right decision? Because far be it from me to",
      "I trust Bane. Albus is to stay away from Scorpius. For his sake, and others.",
      "I think what Harry means is . . .",
      "The professor knows what I mean.",
      "Albus has been checked by the greatest witches and wizards in the country",
      "And Dumbledore — Dumbledore said —",
      "What?",
      "His portrait. We spoke. He said some things which made sense —",
      "Dumbledore is dead, Harry. And I’ve told you before, portraits don’t",
      "He said love had blinded me.",
      "A head teacher ’s portrait is a memoir. It is supposed to be a support",
      "But he was right. I see it now.",
      "Harry, you’ve been put under enormous pressure, the loss of Albus, the",
      "Albus didn’t like me before. He might not like me again. But he will be safe. With the greatest",
      "Harry!",
      "— you don’t understand.",
      "I’d hope that a lifetime spent in the teaching profession would",
      "This map will reveal to you where my son is at all times — I expect you to use it. And if I hear",
      "Perfectly."
    ],
    [
      "Ah yes. Our train absconder. Finally joining us.",
      "Hermione?",
      "Professor Granger I believe is my name, Potter.",
      "What are you doing here?",
      "Teaching. For my sins. What are you doing here? Learning, I hope.",
      "But you’re . . . you’re . . . Minister for Magic.",
      "Been having those dreams again, have you, Potter? Today we’re going to look at Patronus",
      "You’re our Defense Against the Dark Arts teacher?",
      "Losing patience now. Ten points from Gryffindor for stupidity.",
      "No. No. He’s doing it deliberately. He hates Gryffindor and",
      "Sit down, Polly Chapman, before this gets even worse. (POLLY sighs and then sits.) And I",
      "But you’re not this mean.",
      "And that’s twenty points from Gryffindor to assure Albus Potter that I am this mean.",
      "If you don’t sit down right now, Albus . . .",
      "Can I just say —",
      "No, you can’t. Just keep quiet, Potter, otherwise you’ll lose what limited popularity you",
      "No. This is stupid. Where’s Rose? She’ll tell you that you’re being ridiculous.",
      "Who’s Rose? Your invisible friend?",
      "Rose Granger-Weasley! Your daughter! (He realizes.) Of course — because you and Ron",
      "How dare you! Fifty points from Gryffindor. And I assure you if anyone interrupts me"
    ],
    [
      "This is the right decision.",
      "You almost sound convinced.",
      "You told me to be honest with him, but actually I needed to be honest with myself, trust what",
      "Harry, you have one of the greatest hearts of any wizard who ever lived, and I do not believe",
      "I can’t stay long. I won’t need long.",
      "How can I help?",
      "I’m not here to antagonize you. But my son is in tears and I am his father and so I am here to",
      "I’m not keeping them apart.",
      "You’ve changed school timetables, you’ve threatened both teachers and Albus himself. Why?",
      "I have to protect my son.",
      "From Scorpius?",
      "Bane told me he sensed a darkness around my son. Near my son.",
      "What are you implying, Potter?",
      "Are you sure . . . are you really sure he’s yours, Draco?",
      "You take that back . . . right now.",
      "You do not want to do this.",
      "Yes, I do.",
      "I don’t want to hurt you, Draco.",
      "How interesting, because I do want to hurt you.",
      "Expelliarmus!",
      "Incarcerous!",
      "Tarantallegra!",
      "And you’ve got sloppy, Potter. Densaugeo!",
      "Rictusempra!",
      "Flipendo!",
      "We’re the same age, Draco.",
      "I wear it better.",
      "Brachiabindo!",
      "That really the best you got? Emancipare.",
      "Obscuro!",
      "I only left this room three minutes ago!"
    ],
    [
      "So — technically — I shouldn’t be here.",
      "Delphi?",
      "In fact, technically I’m endangering our entire operation . . . which is not . . . well, I’m not a",
      "You’ve never been to Hogwarts?",
      "I was — unwell — as a child — for a few years. Other people got to go — I did not.",
      "You were too — ill? I’m sorry, I didn’t know that.",
      "I don’t advertise the fact — I prefer not to be seen as a tragic case, you know?",
      "Delphi, maybe it is too dangerous for you to be here —",
      "Well — someone’s got to do something about this.",
      "Delphi, none of it worked, time-turning, we failed.",
      "I know. Albus owled me. The history books changed but not enough — Cedric still died. In",
      "And Ron and Hermione have gone completely skewwhiff — and I still haven’t figured out",
      "And that’s why Cedric has to wait. It’s all become quite confused and you’re entirely right to",
      "Oh.",
      "You’re best friends. Every owl he sends I can feel your absence. He’s destroyed by it.",
      "Sounds like he’s found a shoulder to cry on. How many owls has he sent you now?",
      "You know, I didn’t have a best friend when I was your age. I wanted one. Desperately. When I",
      "I had one of those too. Called Flurry. We fell out over the correct rules of Gobstones.",
      "Albus needs you, Scorpius. That’s a wonderful thing.",
      "He needs me to do what?",
      "That’s the thing, isn’t it? About friendships. You don’t know what he needs. You only know he"
    ],
    [
      "Sorry about your kitchen, Ginny.",
      "Oh, it’s not my kitchen. Harry does most of the cooking.",
      "I can’t talk to him either. Scorpius. Especially since — Astoria has gone. I can’t even talk about",
      "Draco, whatever you may think . . .",
      "I always envied you them, you know — Weasley and Granger. I had —",
      "Crabbe and Goyle.",
      "Two lunks who wouldn’t know one end of a broomstick from another. You — the three of you",
      "I envied them too.",
      "I need to protect him —",
      "My father thought he was protecting me. Most of the time. I think you have to make a choice",
      "He’s right.",
      "Tom Riddle didn’t emerge from his dark place. And so Tom Riddle became Lord Voldemort.",
      "Harry. Will you get the Floo powder or shall I?"
    ],
    [
      "Hi.",
      "Scorpius. I can’t . . .",
      "I know. You’re in Gryffindor now. You don’t want to see me now. But here I am anyway.",
      "Well, I can’t talk so . . .",
      "You have to. You think you can just ignore everything that’s happened? The world has gone",
      "I know, okay? Ron’s gone strange. Hermione’s a professor, it’s all wrong, but . . .",
      "And Rose doesn’t exist.",
      "I know. Look, I don’t understand everything but you can’t be here.",
      "Because of what we did, Rose wasn’t even born. Do you remember being told about the",
      "Hermione. And Ron got jealous and behaved like a prat.",
      "Only he didn’t. I found Rita Skeeter ’s book about them. And it’s very different. Ron took",
      "What?",
      "Sshhhh!",
      "As friends. And they danced in a friendly way, and it was nice, and then he danced with",
      "— psychopath.",
      "Hermione was supposed to go to that ball with Krum — do you know why she didn’t?",
      "Wow.",
      "And without Krum, Ron never got jealous and that jealousy was all-important and so Ron",
      "So that’s why Dad’s so — did he change too?",
      "I’m pretty sure your dad is exactly the same. Head of Magical Law Enforcement. Married to",
      "So why is he being such a —",
      "Have you heard me, Albus? This is bigger than you and your dad. Professor Croaker ’s law",
      "Ssshhh!",
      "Fine, let’s go back — fix it. Get Cedric and Rose back.",
      ". . . is the wrong answer.",
      "You’ve still got the Time-Turner, right? No one found it?",
      "Yes, but . . .",
      "Things need fixing, Scorpius. Cedric still needs saving. Rose needs bringing back. We’ll be",
      "No. We won’t. Give it back, Albus! Give it back!",
      "I can’t. This is too important.",
      "Yes, it’s too important — for us. We’re not good at this stuff. We’ll get it wrong.",
      "Who’s saying that we’ll get it wrong?",
      "I say. Because that’s what we do. We mess things up. We lose. We’re losers, true and total",
      "Well, I wasn’t a loser before I met you.",
      "Albus, whatever you’ve got to prove to your dad — this isn’t the way.",
      "I don’t have anything to prove to my dad. I’ve got to save Cedric to save Rose. And maybe —",
      "Without me? Oh poor Albus Potter. With his chip on his shoulder. Poor Albus Potter. So",
      "What are you saying?",
      "Try my life! People look at you because your dad’s the famous Harry Potter,",
      "Don’t even —",
      "Can you even slightly imagine what that’s like? Have you even ever tried? No. Because you",
      "Albus? Albus Potter. Scorpius Malfoy. Are you in there —",
      "Quick. We need to hide.",
      "What?",
      "Scorpius, look at me.",
      "That’s the Invisibility Cloak? Isn’t it James’s?",
      "If she finds us, we’ll be forced apart forever. Please. I didn’t understand. Please.",
      "I am about to enter.",
      "Yes, I stole this from James. He’s remarkably easy to steal from; his trunk combination is the",
      "Thanks.",
      "My dad said — said that you were this dark cloud around me. My dad started to think — and I",
      "Your dad thinks the rumors are true — I am the son of Voldemort?",
      "His department are currently investigating it.",
      "Good. Let them. Sometimes — sometimes I find myself thinking — maybe they’re true too.",
      "No. They’re not true. And I’ll tell you why. Because I don’t think Voldemort is capable of",
      "That’s nice — that’s a nice thing to say.",
      "And it’s something I should have said a long time ago. In fact, you’re probably the best person",
      "I didn’t much like my life without you in it either.",
      "And I know I’ll always be Harry Potter ’s son — and I will sort that out in my head — and I",
      "Albus, as apologies go this is wonderfully fulsome, but you’re starting to talk",
      "Friends?",
      "Always.",
      "But I’m pleased we had this argument because it’s given me a really good idea.",
      "About what?",
      "It involves the second task. And humiliation.",
      "You’re still talking about going back in time? Have we been having the same conversation?",
      "You’re right — we are losers. We’re brilliant at losing and so we should be using our own",
      "That’s a really good strategy.",
      "I know.",
      "I mean, quite spectacular. Humiliate Cedric to save Cedric. Clever. And Rose?",
      "That I’m saving as a sparkly surprise. I can do it without you — but I want you there. Because I",
      "But, just a minute, isn’t — wasn’t — the second task took place in the lake, and you’re not",
      "Yes. About that . . . We need to find the girls’ bathroom on the first floor."
    ],
    [
      "Professor Granger.",
      "Ron. What are you doing here?",
      "Panju got in a little trouble in Potions class. Was showing off, of course, and put the wrong thing",
      "Just combed it, I suspect.",
      "Well . . . Combing it suits you.",
      "Ron, will you stop looking at me like that?",
      "You know, Harry’s boy Albus — said to me the other day that he",
      "Very ridiculous.",
      "He even thought we had a daughter. That’d be strange, wouldn’t it?",
      "More than strange.",
      "Exactly. We’re — friends, and that’s all.",
      "Absolutely. Only — friends.",
      "Only — friends. Funny word — friends. Not that funny. Just a word really. Friends. Friend.",
      "I know.",
      "Well. Must get on. Sort Panju out. Teach him the finer arts of mustache grooming."
    ],
    [
      "Mischief managed.",
      "Professor, I can’t say that ever gets more dignified.",
      "Potter. You’re back. And you seem to have finally ruined my carpet.",
      "I need to find my son. We need to.",
      "Harry, I’ve considered this and decided I want no part of it. Whatever you",
      "Minerva, I come here in peace, not war. I should never have spoken to you that way.",
      "I just don’t think I can interfere in friendships and I believe —",
      "I need to say sorry to you and sorry to Albus, will you give me that chance?",
      "Draco?",
      "He needs to see his son, and I need to see mine.",
      "Like I say — peace — not war.",
      "Well, peace is certainly something I can be part of.",
      "In the girls’ bathroom on the first floor. What on earth would they be doing there?"
    ],
    [
      "So let me get this right — the plan is Engorgement . . .",
      "Yes. Scorpius, that soap, if you may . . .",
      "Nice. Consider me engorgimpressed.",
      "The second task was the lake task. They had to retrieve something which was stolen from",
      "— people they loved.",
      "Cedric used a Bubble-Head Charm to swim through the lake. All we do is follow him in there",
      "But — you still haven’t told me how we’re going to actually get to the lake . . .",
      "Whoa. That feels good. Never used to enjoy that. But when you get to my age, you",
      "Of course — you’re a genius — Moaning Myrtle . . .",
      "What did you call me? Do I moan? Am I moaning now? AM I? AM I?",
      "No, I didn’t mean . . .",
      "What’s my name?",
      "Myrtle.",
      "Exactly — Myrtle. Myrtle Elizabeth Warren — a pretty name — my name — no",
      "Well . . .",
      "It’s been a while. Boys. In my bathroom. In my girls’ bathroom. Well,",
      "You were there, Myrtle — in the lake. They wrote about you. There must be a way out of these",
      "I’ve been everywhere. But where specifically were you thinking?",
      "The second task. The lake task. In the Triwizard Tournament. Twenty-five years ago. Harry",
      "Such a shame the pretty one had to die. Not that your father is not pretty — but",
      "Help us, Myrtle, help us get into that same lake.",
      "You think I can help you travel in time?",
      "We need you to keep a secret.",
      "I love secrets. I won’t tell a soul. Cross my heart and hope to die. Or — the",
      "We can travel in time. You’re going to help us travel the pipes. We’re going to save Cedric",
      "Well, that sounds like fun.",
      "And we’ve no time to lose.",
      "This very sink. This very sink empties directly into the lake. It breaks every bylaw",
      "Some for me and some for you.",
      "Gillyweed? We’re using gillyweed? To breathe underwater?",
      "Just like my dad did. Now, are you ready?",
      "Remember, this time we can’t be caught out by the clock . . .",
      "Five minutes, that’s all we allow for — before we get pulled back to the present.",
      "Tell me this is all going to be okay.",
      "It’s all going to be entirely okay. Are you ready?",
      "No, Albus — Albus —",
      "I do like brave boys.",
      "Then I’m entirely ready. For whatever comes.",
      "Albus . . . Albus . . .",
      "He’s gone.",
      "He’s disappeared. No, he’s traveling under Hogwarts",
      "How is he doing this?",
      "He’s using a rather pretty trinket thingy.",
      "Myrtle!",
      "Oops, you caught me. And I was trying so hard to hide. Hello, Harry. Hello, Draco.",
      "What trinket is he using?",
      "I think it was a secret, but I could never keep anything from you, Harry. How is it",
      "My son is in danger. I need your help. What are they doing, Myrtle?",
      "He’s after saving a dishy boy. A certain Cedric Diggory.",
      "But Cedric Diggory died years ago . . .",
      "He seemed quite confident he could get around that fact. He’s very confident, Harry,",
      "He heard me talking — to Amos Diggory . . . could he have . . . the Ministry’s Time-Turner.",
      "The Ministry has a Time-Turner? I thought they were destroyed?",
      "Isn’t everyone so naughty?",
      "Can someone please explain what’s going on?",
      "Albus and Scorpius are not disappearing and reappearing — they’re traveling. Traveling in"
    ],
    [
      "Ladies and gentlemen — boys and girls — I give you — the greatest — the fabulous",
      "Woooo-hoooooo!",
      "Scorpius Malfoy. Get out of the lake. Get out of the lake. Right now.",
      "Miss. I need help. Please, Miss.",
      "Miss? I’m Professor Umbridge, the headmistress of your school, I’m no “Miss.”",
      "You’re the headmistress? But I . . .",
      "I am the headmistress, and however important your family may be — it doesn’t",
      "There’s a boy in this lake. You need to get help. I’m looking for my friend, Miss. Professor.",
      "Potter? Albus Potter? There’s no such student. In fact, there hasn’t been a Potter at",
      "Harry Potter ’s dead?",
      "Have you swallowed something funny in there? Become a Mudblood without any",
      "Voldemort Day?"
    ],
    [
      "Scorpius. Thank you so much for coming to see me.",
      "Headmistress.",
      "Scorpius, I’ve thought for a long time that you have Head Boy potential, as you",
      "Athletic?",
      "No need to be modest, Scorpius. I’ve seen you on the Quidditch pitch, there’s",
      "Has it?",
      "But in the three days since I found you in that lake on Voldemort Day, you’ve",
      "I don’t . . .",
      "Questioning everyone you can about the Battle of Hogwarts. How Potter died.",
      "No. No. Consider me restored. Temporary aberration. That’s all.",
      "So we can continue our work together?",
      "We can.",
      "For Voldemort and Valor.",
      "For — um — yes."
    ],
    [
      "Hey, Scorpion King.",
      "We’re still on, right, tomorrow night?",
      "Because we are ready to spill some proper Mudblood guts.",
      "Scorpius.",
      "Polly Chapman?",
      "Shall we cut to it? I know everyone is waiting to know who you’re going to ask",
      "Right.",
      "Which would be great. If you were interested. Which rumor is — you are. And I just",
      "That’s um — great but — what are we talking about?",
      "The Blood Ball, of course. Who you — the Scorpion King — are taking to the Blood",
      "You — Polly Chapman — want me to take you to a — ball?",
      "Mudbloods, of course. In the dungeons. Your idea, wasn’t it? What’s going on with",
      "For Voldemort it is."
    ],
    [
      "You are late.",
      "This is your office?",
      "You are late and unapologetic, maybe you are determined to compound the problem.",
      "You’re Head of Magical Law Enforcement?",
      "How dare you! How dare you embarrass me and keep me waiting and then not apologize for",
      "Sorry.",
      "Sir.",
      "Sorry, sir.",
      "I did not bring you up to be sloppy, Scorpius. I did not bring you up to humiliate me at",
      "Humiliate you, sir?",
      "Harry Potter, asking questions about Harry Potter, of all the embarrassing things. How dare",
      "Oh no. Are you responsible? No. No. You can’t be.",
      "Scorpius . . .",
      "The Daily Prophet today — three wizards blowing up bridges to see how many Muggles",
      "Be very careful.",
      "The “Mudblood” death camps, the torture, the burning alive of those that oppose him. How",
      "Do not use her name in vain, Scorpius. Do not score points that way. She deserves better than",
      "She said that Grandfather didn’t like her very much — opposed the match — thought she",
      "She made being brave very easy, your mother.",
      "But that was — another you.",
      "We haven’t become anything — we simply are as we are.",
      "The Malfoys. The family you can always rely on to make the world a murkier place.",
      "This business at the school — what’s inspired it?",
      "I don’t want to be who I am.",
      "And what’s brought that on?",
      "I’ve seen myself in a different way.",
      "You know what I loved most about your mother? She could always help me find light in the",
      "Did she?",
      "There’s more of her in there than I thought.",
      "Yes. Sir.",
      "For Voldemort and Valor.",
      "For Voldemort and Valor."
    ],
    [
      "How did Cedric become a Death Eater? What have I missed? Find me some — light in the",
      "Why are you here?",
      "Why can’t I be here?",
      "It’s not ready yet. I’m working as fast as I can. But Professor Snape sets so much of",
      "Start again. From the beginning. What’s not ready?",
      "Your Potions homework. And I’m happy to do it — grateful even — and I know you",
      "I hate homework?",
      "You’re the Scorpion King. Of course you hate homework. What are you doing with",
      "Did he say Snape?"
    ],
    [
      "Did no one teach you to knock, boy?",
      "Severus Snape. This is an honor.",
      "Professor Snape will do fine. You may behave like a king at this school, Malfoy, but that",
      "But you’re the answer . . .",
      "How very pleasant for me. If you’ve got something to say, boy, then please say it . . . If not,",
      "I need your help.",
      "I exist to serve.",
      "I just don’t know what help I — need. Are you still undercover now? Are you still working",
      "Dumbledore? Dumbledore’s dead. And my work for him was public — I taught in his school.",
      "No. That’s not all you did. You watched the Death Eaters for him. You advised him.",
      "These are very dangerous allegations, boy. And don’t think the Malfoy name will prevent me",
      "What if I was to tell you there was another world — another world in which Voldemort was",
      "I’d say that the rumors of Hogwarts’s beloved Scorpion King losing his mind are well-",
      "There was a stolen Time-Turner. I stole a Time-Turner. With Albus. We tried to bring",
      "Harry Potter won that Triwizard Tournament.",
      "He wasn’t supposed to do it alone. Cedric was supposed to win it with him. But we",
      "Cedric Diggory killed only one wizard and not a significant one — Neville Longbottom.",
      "Oh, of course, that’s it! Professor Longbottom was supposed to kill Nagini, Voldemort’s",
      "I can see this is a Malfoy game. Get out before I alert your father and plunge you into deep",
      "You loved his mother. I don’t remember everything. I know you loved his mother. Harry’s",
      "Harry Potter is dead.",
      "Not in my world. He said you were the bravest man he’d ever met. He knew, you see — he",
      "Colloportus!",
      "Just a question, but where — exactly — are we going?",
      "We’ve had to move many times. Everywhere we’ve settled they destroyed. This will take us to a",
      "Okay, who’s we?",
      "Oh. You’ll see."
    ],
    [
      "You make one more move and your brain will be a frog and your arms will be rubber.",
      "Safe. He’s safe. (Beat.) You know you never could listen. You were a terrible bore of a student",
      "I was an excellent student.",
      "You were moderate to average. He’s on our side!",
      "I am, Hermione.",
      "Most people know me as Granger. And I don’t believe a word you say, Malfoy —",
      "It’s all my fault. My fault. And Albus’s.",
      "Albus? Albus Dumbledore? What’s Albus Dumbledore got to do with this?",
      "He doesn’t mean Dumbledore. You may need to sit down.",
      "Snape, a royal visit, and — (he sees SCORPIUS  and is immediately alarmed) what’s he doing here?",
      "He’s safe, Ron.",
      "Thank Dumbledore for that."
    ],
    [
      "So you’re telling me that the whole of history rests on . . . Neville Longbottom? This is pretty",
      "It’s true, Ron.",
      "Right. And you’re sure because . . .",
      "What he knows about Snape — about all of us — there’s no way he could . . .",
      "Maybe he’s a really good guesser?",
      "I’m not. Can you help?",
      "We’re the only ones that can. Dumbledore’s Army has shrunk considerably since its peak. In fact,",
      "Less wanted.",
      "To be clear",
      "Voldemort is dead. Killed in the Battle of Hogwarts. Harry is Head of Magical Law",
      "I’m Minister for Magic?",
      "Brilliant. What do I do?",
      "You run Weasleys’ Wizard Wheezes.",
      "Okay, so, she’s Minister for Magic and I run a — joke shop?",
      "You’re mostly focused on bringing up your kids.",
      "Great. I expect their mother is hot.",
      "Well . . . Um . . . Depends what you think of . . . The thing is, you two sort of have",
      "Close your mouth when you’re looking at me, Weasley.",
      "I’m dead, presumably.",
      "Bravely.",
      "Who?",
      "Voldemort.",
      "How very irritating.",
      "I’m sorry, Severus.",
      "Well, at least I’m not married to him.",
      "Which spells did you use?",
      "Expelliarmus in the first task and Engorgio in the second.",
      "Simple Shield Charms should set both of those right.",
      "And then you left?",
      "The Time-Turner took us back, yes. That’s the thing — this Time-Turner, you only get five",
      "And can you still only move in time, not space?",
      "Yes, yes, it’s — uh — you travel back in the same spot you stand in —",
      "Interesting.",
      "Then it’s just me and the boy.",
      "No offense, Snape, but I’m not trusting this to anyone, it’s too important.",
      "Hermione, you’re the most wanted rebel in the wizarding world. Doing this will require you to",
      "Not for a long time, but —",
      "If you’re found outside, the dementors will kiss you — they’ll suck out your soul.",
      "Severus, I’m done with living off scraps, making failed attempts at coups. This is our",
      "You’re risking everything —",
      "We get this right, Harry’s alive, Voldemort’s dead, and the Augurey is gone, for that no",
      "Sometimes costs are made to be borne.",
      "No, I’m pretty sure that’s pure Severus Snape."
    ],
    [
      "And Cedric Diggory has entered the stage. And he seems ready. Scared but ready. He",
      "Don’t",
      "This is taking too long. The Time-Turner is spinning.",
      "What has this young, brave, handsome man got up his sleevies now?"
    ],
    [
      "Ow. Ow. Owwwwwww.",
      "Ron . . . Ron . . . What has it done to you?",
      "Oh no. I knew it.",
      "The Time-Turner did something to Albus too. The first time we went back.",
      "Useful — time to — ow — tell us.",
      "We’re aboveground. We need to move. Now.",
      "Ron, you can still walk, come on . . .",
      "Did it work?",
      "We blocked the spell. Cedric kept his wand. Yes. It worked.",
      "But we came back to the wrong place — we are outside. You are outside.",
      "We need to use the Time-Turner again — get out of here —",
      "We need to find shelter. We’re horribly exposed.",
      "Too late.",
      "This is a disaster.",
      "They’re after me, not any of you. Ron. I love you and I",
      "What?",
      "What?",
      "Can we talk about the love thing first?",
      "This is still Voldemort’s world. And I am done with it. Reversing the next task will change",
      "But they’ll kiss you. They’ll suck out your soul.",
      "And then you’ll change the past. And then they won’t. Go. Now.",
      "Go. We go.",
      "You’re supposed to be going too.",
      "Well, they are after me a bit and I really am in quite a lot of pain. And, you know, I’d rather be",
      "Let’s keep them here and give the boy the best chance we can.",
      "And a son. I liked that idea too.",
      "Kiss me.",
      "Let’s get down to the water. Walk. Don’t run.",
      "They just sucked out their souls.",
      "Think of something else, Scorpius. Occupy your thoughts.",
      "I feel cold. I can’t see. There’s a fog inside me — around me.",
      "You’re a king, and I’m a professor. They’ll only attack with good reason. Think about those",
      "I can hear my mother. She wants me — my help — but she knows I can’t — help.",
      "Listen to me, Scorpius. Think about Albus. You’re giving up your kingdom for Albus, right?",
      "The world changes and we change with it. I am better off in this world. But the world is not",
      "Professor Snape!",
      "Professor Umbridge.",
      "Have you heard the news? We’ve caught that traitorous Mudblood Hermione",
      "That’s — fantastic.",
      "With you. Granger was with you.",
      "With me? You’re mistaken.",
      "With you and Scorpius Malfoy. A student I’m becoming increasingly concerned",
      "Well . . .",
      "Dolores, we’re late for class, so if you’ll excuse us . . .",
      "If you’re late for class, why are you not heading back to the school? Why are you",
      "How long have you suspected?",
      "Years. And I should have acted upon it far earlier.",
      "Depulso!",
      "A doe? Lily’s Patronus.",
      "Strange, isn’t it? What comes from within.",
      "Thank you for being my light in the darkness.",
      "Tell Albus — tell Albus Severus — I’m proud he carries my name. Now go. Go.",
      "Whoa!",
      "Albus!",
      "That was close! Did you see that Merman? The guy with the — and then the thing with the —",
      "It’s you.",
      "It was weird though — I thought I saw Cedric start to expand — but then he sort of started",
      "You have no idea how good it is to see you again.",
      "You just saw me two minutes ago.",
      "A lot has happened since then.",
      "Careful. You’re drowning me. What are you wearing?",
      "What am I wearing? (He pulls off his cloak.) What are you wearing? Yes! You’re in",
      "Did it work? Did we do anything?",
      "No. And it’s brilliant.",
      "What? We failed.",
      "Yes. YES. AND IT’S AMAZING.",
      "Scorpius. Have you been eating too many sweets again?",
      "There you go, you see — all dry humor and Albus-y. I love it.",
      "Now I’m starting to get worried . . .",
      "Albus. Albus. Are you okay?",
      "Harry! It’s Harry Potter! And Ginny. And Professor McGonagall. And Dad. My",
      "Hello, Scorpius.",
      "You’re all here.",
      "And Myrtle told us everything.",
      "What is going on?",
      "You’re the one who’s just returned from time. Why don’t you tell us?",
      "Oh no. Oh bother. Where is it?",
      "Just returned from where?",
      "I’ve lost it! I’ve lost the Time-Turner.",
      "You’ve lost what?",
      "Time to cut the pretense, Albus.",
      "I think you’ve got some explaining to do."
    ],
    [
      "So to be clear — you illegally jumped off the Hogwarts Express, you",
      "I agree it doesn’t sound good.",
      "And your response to disappearing Hugo and Rose Granger-Weasley was to",
      "Yes, Professor.",
      "Yes.",
      "Professor, if I may —",
      "You may not. What you choose to do as parents is your matter but this is my",
      "Seems fair.",
      "I should expel you but (with a look to HARRY) all things considered — I think it",
      "What did I miss?",
      "It is considered polite to knock when entering a room, Hermione",
      "Ah.",
      "If I could also give a detention to you, Minister, I would. Keeping hold of a",
      "In my defense —",
      "And in a bookcase. You kept it in a bookcase. It’s almost laughable.",
      "Minerva. (There is an intake of breath.) Professor McGonagall —",
      "Your children didn’t exist!",
      "I know.",
      "Your intentions to save Cedric were",
      "A horrific world.",
      "You are so young. (She looks at HARRY, DRACO, GINNY, and HERMIONE.) You’re",
      "Yes, Professor.",
      "Yes, Professor.",
      "Go on. Get out. The lot of you. And find me that Time-Turner."
    ],
    [
      "Thanks for letting me come up.",
      "Green is a soothing color, isn’t it? I mean Gryffindor rooms are all well and good but the",
      "Can you explain why you tried to do this?",
      "I thought I could — change things. I thought Cedric — it’s unfair.",
      "Of course it’s unfair, Albus, don’t you think I know that? I was there. I saw him die. But to do",
      "I know.",
      "If you were trying to do as I did, you went the wrong way about",
      "I know. Okay. I know.",
      "Well, I was wrong too — to think Scorpius was Voldemort’s son. He wasn’t a black cloud.",
      "No.",
      "And I’ve locked away the map. You won’t see it again. Your mum left your room exactly as it",
      "Really scared you?",
      "Yes.",
      "I thought Harry Potter wasn’t afraid of anything?",
      "Is that how I make you feel?",
      "I don’t think Scorpius said, but when we returned after failing to fix the first task, I was",
      "No. I know. It’s not just about that.",
      "No.",
      "No. Nor me."
    ],
    [
      "Go on then, lay down your grotty little flowers and then let’s go. I already hate this",
      "Aunt Petunia. We’re their last living relatives, right?",
      "Yes. You and I. Yes.",
      "And — they weren’t popular? You said they didn’t have any friends?",
      "Lily tried — bless her — she tried — it wasn’t her fault, but she repelled people — by",
      "So my question is — why are there so many flowers? Why are there flowers all over",
      "Oh. Yes. Well, I suppose there are a — few. Must have blown over from the other",
      "But they’re all marked with their names . . . “Lily and James, what you did, we will",
      "I smell guilt, there is a stench of guilt upon the air.",
      "Get away. Get away from there.",
      "Do you still see with my eyes, Harry Potter?",
      "Dad . . . Dad . . ."
    ],
    [
      "Harry? Harry? What is it? You were screaming . . .",
      "They haven’t stopped. The dreams.",
      "They weren’t likely to stop immediately. It’s been a stressful time and —",
      "But I was never in Godric’s Hollow with Petunia. This doesn’t —",
      "Harry, you’re really scaring me.",
      "He’s still here, Ginny.",
      "Who’s still here?",
      "Voldemort. I saw Voldemort and Albus.",
      "And Albus . . . ?",
      "He said — Voldemort said — “I smell guilt, there is a stench of guilt upon the air.” He was",
      "Harry, is Albus still in danger?",
      "I think we all are."
    ],
    [
      "Albus . . . Psst . . . Albus.",
      "Pleasant. That’s a pleasant and not scary way to wake up.",
      "You know it’s the strangest of things, but ever since being in the scariest place imaginable",
      "Good.",
      "I mean, normally, being in lockdown, being in constant detention, it’d break me, but now —",
      "You’re scary when you’re in a good mood, you know that?",
      "When Rose came up to me today in Potions and called me Bread Head I almost hugged her.",
      "I’m not sure being fearless is going to be good for your health.",
      "You don’t know how good it is to be back here, Albus. I hated it there.",
      "Apart from the Polly Chapman fancying you bits.",
      "Cedric was a different person entirely — dark, dangerous. My dad — doing anything they",
      "But you changed things. You had a chance and you changed time back. Changed yourself back.",
      "Only because I knew what I should be.",
      "Do you think I’ve been tested too? I have, haven’t I?",
      "No. Not yet.",
      "You’re wrong. The stupid thing wasn’t going back once — anyone can make that mistake —",
      "We both went back, Albus.",
      "And why was I so determined to do this? Cedric? Really? No. I had something to prove. My",
      "But it didn’t. And you’re to thank for that as much as me. When the dementors were —",
      "Yes. I do. I do know that.",
      "Good. Then you can help me destroy this.",
      "I’m pretty sure you told everyone that was on the bottom of a lake.",
      "Turns out Malfoy the Unanxious is a pretty good liar.",
      "Scorpius . . . We should tell someone about this . . .",
      "Who? The Ministry kept it before, do you really trust them not to keep it again? Only you",
      "You’re quite proud of that phrase, aren’t you?",
      "Been working on it all day."
    ],
    [
      "Can I repeat again? This is against the rules and it’s the middle of the night.",
      "I need to find my son.",
      "I know who you are, Mr. Potter, but even you must understand that it’s against",
      "Please don’t be tiresome, Craig.",
      "You got our message? Good.",
      "Headmistress. I’m — I was just —",
      "He’s gone?",
      "Yes.",
      "And young Malfoy?",
      "Oh no.",
      "Then let’s turn this school upside down. Craig, we’ve work to do . . .",
      "Haven’t we been here before?",
      "Something feels even worse this time.",
      "You spoke to him earlier?",
      "Yes.",
      "You came to his dorm and talked to him?",
      "You know I did.",
      "What did you say to our son, Harry?",
      "I tried to be honest like you said — I didn’t say anything.",
      "And you controlled yourself? How heated did it get?",
      ". . . I don’t think I . . . You think I’ve scared him away again?",
      "I can forgive you for one mistake, Harry, maybe even two, but the more mistakes you make,"
    ],
    [
      "So I think a simple Confringo.",
      "Definitely not. For something like this you need Expulso.",
      "Expulso? Expulso and we’ll be clearing bits of Time-Turner from this owlery for days.",
      "Bombarda?",
      "And wake up everyone in Hogwarts? Maybe Stupefy. They were originally destroyed using",
      "Exactly, it’s been done before — let’s do something new, something fun.",
      "Fun? Look, many wizards overlook the importance of choosing the right spell, but this",
      "“A much-underestimated part of modern witchcraft” — you two are the greatest, you know",
      "Wow. You’re . . . um . . . What are you doing here?",
      "It felt important to send an owl — let her know what we’re doing, you know?",
      "What concerns me? What’s this about?",
      "We need to destroy the Time-Turner. The things Scorpius saw after the second task . . . I’m so",
      "Your owl said so little . . .",
      "Imagine the worst possible world, and then double it. People being tortured, dementors",
      "Voldemort ruled? He was alive?",
      "He ruled everything. It was terrible.",
      "Because of what we did?",
      "Humiliating Cedric turned him into a very angry young man, and then he became a Death",
      "A Death Eater?",
      "And a murderer. He killed Professor Longbottom.",
      "Then — of course — we need to destroy it.",
      "You understand?",
      "I’ll go further than that — I’ll say Cedric would have understood. We’ll destroy it together,",
      "Thank you.",
      "What?",
      "On your back. I hadn’t noticed it before. The wings. Is that what the Muggles call a tattoo?",
      "Oh. Yes. Well, it’s an Augurey.",
      "An Augurey?",
      "Haven’t you met them in Care of Magical Creatures? They’re sinister-looking black birds that",
      "Your . . . guardian?",
      "She used to say it was crying because it could see I was going to come to a sticky end. She",
      "Why would you want a tattoo of her bird, then?",
      "It reminds me that the future is mine to make.",
      "Cool. I might get an Augurey tattoo.",
      "The Rowles were pretty extreme Death Eaters.",
      "Come on, let’s get destroying . . . Confringo? Stupefy? Bombarda? Which would you use?",
      "Give it back. Give us back the Time-Turner.",
      "What?",
      "Scorpius? What are you doing?",
      "I don’t believe you ever were ill. Why didn’t you come to Hogwarts? Why are you here",
      "I’m trying to bring my cousin back!",
      "They called you the Augurey. In — the other world — they called you the Augurey.",
      "The Augurey? I rather like that.",
      "Delphi?",
      "Fulgari!",
      "Albus. Run!",
      "Fulgari!",
      "But why? But what? But who are you?",
      "Albus. I am the new past."
    ],
    [
      "I can’t get over it, really. The fact that in some realities we aren’t even, you know, married.",
      "Ron, whatever this is, I’ve got ten minutes until the goblins show up to talk security at",
      "I mean, we’ve been together so long — and married for so long — I mean, so long —",
      "If this is your way of saying you want a marital break, Ron, then, to be clear, I will skewer",
      "Shut up. Will you shut up for once? I want to do one of those marriage renewal things I’ve read",
      "You want to marry me again?",
      "Well, we were only young when we did it the first time and I got very drunk and — well, to be",
      "You’re sweet.",
      "And you taste of toffee . . .",
      "Harry, Ginny, and — I, uh — Draco — how lovely to see you —",
      "The dreams. They’ve started again, well, they haven’t stopped.",
      "And Albus is missing. Again.",
      "Scorpius too. We’ve had McGonagall check the entire school. They’re gone.",
      "I’ll get the Aurors summoned immediately, I’ll —",
      "No, you won’t, it’s all fine. Albus — I saw him last night. It’s all good.",
      "Where?",
      "I was having a couple of firewhiskies with Neville in Hogsmeade — as you do — setting the",
      "Ron, if you could get to the point before we all strangle you?",
      "He hasn’t run away — he’s having a quiet moment — he’s got himself an older girlfriend —",
      "An older girlfriend?",
      "And a cracking one at that — gorgeous silver hair. Saw them on the roof together, near the",
      "Her hair — was it silver and blue?",
      "That’s it — silver, blue — yup.",
      "He’s talking about Delphi Diggory. Niece of — Amos Diggory.",
      "This is about Cedric again?",
      "Ethel! Cancel the goblins."
    ],
    [
      "Where are they?",
      "Harry Potter, and what can I do for you, sir? And Draco Malfoy. I am blessed.",
      "I know how you’ve used my son.",
      "I’ve used your son? No. You, sir — you used my beautiful son.",
      "Tell us — now — where are Albus and Scorpius? Or face the profoundest consequences.",
      "But why would I know where they are?",
      "Don’t play the senility card with us, old man. We know you’ve been sending him owls.",
      "I’ve done nothing of the kind.",
      "Amos, you’re not too old for Azkaban. They were last seen on the Hogwarts tower with your",
      "I have no idea what you are . . . (He stops, a beat, confused.) My niece?",
      "There are no depths to which you won’t sink, are there — yes, your niece, are you denying she",
      "Yes, I am — I don’t have a niece.",
      "Yes, you do, a nurse, works here. Your niece . . . Delphini Diggory.",
      "I know I don’t have a niece because I never had any brothers and sisters. And nor did my wife.",
      "We need to find out who she is — now."
    ],
    [
      "What are we doing on the Quidditch pitch?",
      "The Triwizard Tournament. The third task. The maze. This is where the maze was. We’re",
      "Yes, it is time to spare the spare once and for all. We will go back for Cedric and in doing so",
      "Hell. You want to resurrect hell?",
      "I want a return to pure and strong magic. I want to rebirth the Dark.",
      "You want Voldemort’s return?",
      "The one true ruler of the wizarding world. He will return. Now, you’ve ensured the first two",
      "We won’t stop him — whatever you force us to do — we know he needs to win the tournament",
      "I don’t just want you to stop him. I want you to humiliate him. He needs to fly out of that maze",
      "Wasn’t aware that there was a prophecy, what prophecy?",
      "You have seen the world as it should be, Scorpius, and today we’re going to ensure its return.",
      "We won’t. We won’t obey you. Whoever you are. Whatever you want us to do.",
      "Of course you will.",
      "You’ll have to use Imperio. You’ll have to control me.",
      "No. To fulfill the prophecy, this has to be you, not a puppet of you. You have to be the one to",
      "Do your worst.",
      "I will.",
      "No!",
      "Yes, as I thought — this seems to frighten you more.",
      "Albus, whatever she does to me — we can’t let her —",
      "Crucio!",
      "I will . . .",
      "What? What on earth do you think you can do? A wizardwide disappointment? A",
      "Stop. Please.",
      "Scorpius? Albus? Everyone’s looking for you —",
      "Craig. Get away. Get help!",
      "What’s happening?",
      "Avada Kedavra!",
      "friendship. You will do exactly as you’re told, otherwise Scorpius will die, just like that",
      "Then will the"
    ],
    [
      "Ladies and gentlemen — boys and girls — I give you — the greatest — the fabulous",
      "Where is he? Where is Cedric?",
      "The hedges want to kill us too? This gets better and better.",
      "You will keep up or face the consequences.",
      "The perils are plentiful, but the prizes are palpable. Who will fight their way through?",
      "Albus, we need to do something.",
      "I know, but what? She has snapped our wands, we’re bound, and she’s threatening to kill you.",
      "I’m ready to die if it’ll stop Voldemort returning.",
      "Are you?",
      "You won’t have to mourn me for long, she’ll kill me and quickly kill you too.",
      "The flaw in the Time-Turner, the five-minute rule. We do all we can to run down",
      "It won’t work.",
      "Now let me remind you of the current standings! Tied in first place — Mr. Cedric",
      "Where did she go?",
      "Does it matter? Which way do you think?",
      "You poor creatures.",
      "You’re not — even on a broom.",
      "Brooms — such unwieldy, unnecessary objects. Three minutes gone. We have two minutes",
      "No. We won’t.",
      "You think you can fight me?",
      "No. But we can defy you. If we lay down our lives to do so.",
      "The prophecy must be fulfilled. We will fulfill it.",
      "Prophecies can be broken.",
      "You’re mistaken, child, prophecies are the future.",
      "But if the prophecy is inevitable why are we here trying to influence it? Your actions",
      "You talk too much, child. Crucio!",
      "Scorpius!",
      "You wanted a test, Albus, this is it, and we’re going to pass it.",
      "Then you will die.",
      "Yes. We will. And we’ll do so gladly knowing it’s stopped you.",
      "We don’t have time for this. Cru —",
      "Expelliarmus!",
      "a young, good-looking lad of seventeen or so, CEDRIC.",
      "Come no further.",
      "But you’re . . .",
      "Cedric Diggory. I heard screaming, I had to come. Name yourselves, beasts. I can fight you.",
      "Cedric?",
      "You saved us.",
      "Are you also a task? An obstacle? Speak. Do I have to defeat you too?",
      "No. You just have to free us. That’s the task.",
      "Emancipare! Emancipare!",
      "I’m afraid you have to finish the maze.",
      "Then I shall.",
      "Cedric —",
      "What?",
      "Just thought you should know that.",
      "Okay. Um. Thank you.",
      "Albus.",
      "No. Wait . . .",
      "The Time-Turner is spinning . . . Look at what she’s doing . . . She can’t leave us behind.",
      "What have we done?",
      "We had to go with the Time-Turner, we had to try to stop her.",
      "Stop me? How do you think you’ve stopped me? I am done with this. You may have destroyed",
      "I’m",
      "No . . . No . . . You can’t . . .",
      "Utterly. We’re stuck here. In time. Wherever in time we are. Whatever it is she’s planning to",
      "Hogwarts looks the same.",
      "Yes. And we can’t be seen here. Let’s get out of here before we’re spotted.",
      "We need to stop her, Scorpius.",
      "I know we do — but how?"
    ],
    [
      "It must have been a Confundus Charm she used on him. Used on them all. She faked being a",
      "I’ve just checked in with the Ministry — but there’s no record of her. She’s a shadow.",
      "Specialis Revelio!",
      "Where can she have hidden anything? It’s quite a spartan room.",
      "These panels, these panels must conceal something.",
      "Or the bed does.",
      "What you hiding? What you got?",
      "Maybe we should all stop for a moment and have a think about what —",
      "That’s — I’m not supposed to be understanding — that’s Parseltongue.",
      "And what does it say?",
      "How do I . . . ? I haven’t been able to understand Parseltongue since Voldemort died.",
      "And nor has your scar hurt.",
      "It says “Welcome, Augurey.” I think I need to tell it to open . . .",
      "Then do it.",
      "“When spares are spared, when time is turned, when unseen children murder their fathers",
      "A prophecy. A new prophecy.",
      "Cedric — Cedric was called a spare.",
      "When time is turned — she has that Time-Turner, doesn’t she?",
      "She must do.",
      "But why does she need Scorpius or Albus?",
      "Because I’m a parent — who hasn’t seen his child. Hasn’t understood his child.",
      "Who is she? To be so obsessed with all this?",
      "I think I’ve got the answer to that.",
      "No. She can’t . . .",
      "How is it even — possible?",
      "Voldemort had a daughter?",
      "No, no, no. Not that. Anything but that."
    ],
    [
      "Thank you. I’m so pleased so many of you were able to make my — second —",
      "She? A daughter? He had a daughter?",
      "Yes. A daughter.",
      "And is she now in custody?",
      "Professor, she did ask for no questions.",
      "It’s fine, Harry. No, Professor, that’s where this gets worse. I’m afraid we’ve no means of",
      "We can’t — look for her?",
      "We have good reason to believe — she’s hidden herself — in time.",
      "Of all the reckless stupid things, you kept the Time-Turner even now?",
      "Professor, I assure you —",
      "Shame on you, Hermione Granger.",
      "No, she doesn’t deserve that. You have a right to be angry. You all do. But this is not all",
      "Whether our son gave it her. Or whether it was stolen from him.",
      "Your solidarity is admirable, but it doesn’t make your negligence negligible.",
      "Then it’s a negligence I too should face.",
      "Just to say — I didn’t know about much of it so can’t take responsibility — and I’m pretty sure",
      "No one can know where they are — whether they’re together or apart. I trust that our sons will",
      "We haven’t given up. We’ve gone to the giants. The trolls. Everyone we can find. The",
      "But there is one truth we can’t escape",
      "And if she succeeds?",
      "Then — just like that — most of the people in this room will be gone. We’ll no longer exist"
    ],
    [
      "One of us should talk to him, don’t you think?",
      "Hello, Mr. Stationmaster. Mr. Muggle. Question",
      "You know what annoys me most of all? Dad will think we did it deliberately.",
      "Albus. Really? I mean, really really? We’re — trapped — lost — in time — probably",
      "There’s a lot to understand. Dad’s pretty complicated.",
      "And you’re not? Not to question your taste in women, but you fancied . . . well . . .",
      "I did, didn’t I? I mean, what she did to Craig . . .",
      "Let’s not think about that. Let’s focus on the fact that we have no wands, no brooms, no",
      "Ye ken th’ auld reekie train is running late, boys?",
      "Sorry?",
      "If you’re waiting oan th’ auld reekie train, you’ll need tae ken it’s running late. Train",
      "I know where she is.",
      "You understood that?",
      "Look at the date. On the timetable.",
      "The 30th October, 1981. Day before Hallows’ Eve, thirty-nine years ago. But — why is she?",
      "The death of my grandparents. The attack on my dad as a baby . . . The moment when",
      "The big one?",
      "“The one with the power to vanquish the Dark Lord approaches . . .”",
      "“. . . born to those who have thrice defied him, born as the seventh month",
      "It’s my fault. I told her that prophecies can be broken — I told her the whole logic of",
      "In twenty-four hours’ time Voldemort curses himself trying to kill the baby Harry Potter."
    ],
    [
      "Well, there’s no visible signs of attack that I can see . . .",
      "This is Godric’s Hollow?",
      "Your dad’s never taken you?",
      "No, he tried to a few times but I refused.",
      "Well, there’s no time for a tour — we have a murderous witch to save the world from — but",
      "The Church, St. Jerome’s . . .",
      "It’s magnificent.",
      "And St. Jerome’s graveyard is supposedly magnificently haunted, (he points in another",
      "My dad has a statue?",
      "Oh. Not yet. But he will. Hopefully. And this — this house is where Bathilda Bagshot lived,",
      "The Bathilda Bagshot? A History of Magic Bathilda Bagshot?",
      "The very same. Oh my, that’s her. Wow. Squeak. My geekness is a-quivering.",
      "Scorpius!",
      "And here it is —",
      "The home of James, Lily, and Harry Potter . . .",
      "They can’t see you, Albus, it might damage time, and we’re not doing that — not this time.",
      "But this means, she hasn’t . . . We’ve made it . . . She hasn’t . . .",
      "So what do we do now? Get ready to fight her? Because she’s pretty . . . Fierce.",
      "Yes. We haven’t really thought this one through, have we? What do we do now? How do we"
    ],
    [
      "Good evening, Harry.",
      "Professor Dumbledore, in my office, I’m honored. I must be where the action is tonight?",
      "What are you doing?",
      "Going through papers, seeing if I’ve missed anything I shouldn’t have. Marshaling forces to",
      "I’m here now.",
      "Here just as the battle is lost. Or are you denying that Voldemort is going to return.",
      "It is — possible.",
      "Go. Leave. I don’t want you here, I don’t need you. You were absent every time it really",
      "Harry, don’t you think I wanted to fight him on your behalf? I would have spared you if",
      "“Love blinds us”? Do you even know what that means? Do you even know how bad that advice",
      "If you’re referring to Privet Drive, then —",
      "Years — years I spent there alone, without knowing what I was, or why I was there, without",
      "I — did not wish to become attached to you —",
      "Protecting yourself, even then!",
      "No. I was protecting you. I did not want to hurt you . . .",
      "You would have hurt me less if you had told me this then.",
      "I was blind. That is what love does. I couldn’t see that you needed",
      "It isn’t true that I never complained.",
      "Harry, there is never a perfect answer in this messy, emotional world. Perfection is",
      "the knowledge that pain will come again. Be honest to those you",
      "You said that to me once before.",
      "It is all I have to offer you tonight.",
      "Don’t go!",
      "Those that we love never truly leave us, Harry. There are things that death cannot touch.",
      "I loved you too, Dumbledore.",
      "I know.",
      "Did you know that in this other reality — the reality Scorpius saw into — I was Head of",
      "Come in — I’ll give you the tour.",
      "The thing is, though — never really fancied being a Ministry man. Even as a child. My dad,",
      "What did you want to do?",
      "Quidditch. But I wasn’t good enough. Mainly I wanted to be happy.",
      "Of course. What — serious — business?",
      "Do you think Theodore Nott had the only Time-Turner?",
      "What?",
      "The Time-Turner the Ministry seized was a prototype. Made of inexpensive metal. It does the",
      "He was working for you?",
      "No. My father. He liked owning things that no one else had. The Ministry’s Time-Turners —",
      "And did you keep it?",
      "No five-minute problem, and it gleams like gold, just the way the Malfoys like it. You’re",
      "Hermione Granger. It was the reason she kept the first, the fear that there might be a second.",
      "Consider the alternative — consider if people had known that I had the ability to travel in time.",
      "Scorpius.",
      "We were capable of having children but Astoria was frail. A blood malediction, a serious one.",
      "I’m sorry, Draco.",
      "I didn’t want to risk her health, I said it didn’t matter whether the Malfoy line died with me —",
      "I can’t imagine what that was like.",
      "Astoria always knew that she was not destined for old age. She wanted me to have somebody",
      "Love blinds. We have both tried to give our sons, not what they needed, but what we needed.",
      "Which is why you need this. I have been holding on to it, barely resisting using it, even though",
      "Oh, Draco . . . we can’t. We can’t use it.",
      "We have to find them — if it takes centuries, we must find our sons —",
      "We have no idea where they are or when they are. Searching in time when you’ve no idea"
    ],
    [
      "We tell my granddad and grandma?",
      "That they’ll never get to see their son grow up?",
      "She’s strong enough — I know she is — you saw her.",
      "She looked wonderful, Albus. And if I were you I’d be desperate to talk to her. But she needs",
      "Dumbledore. Dumbledore’s alive. We get Dumbledore involved. We do what you did with",
      "Can we risk him knowing your dad survives? That he has kids?",
      "He’s Dumbledore! He can cope with anything!",
      "Albus, there have been about a hundred books written on what Dumbledore knew, how he",
      "So we need to — talk to the future. We need to send Dad a message.",
      "But we don’t have an owl that can fly through time. And he doesn’t have a Time-Turner.",
      "We get a message to Dad, he’ll find a way to get back here. Even if he has to build a Time-",
      "We send a memory — like a Pensieve — stand over him and send a message, hope he",
      "Only slightly.",
      "A bit of trauma now is nothing compared to what’s happening . . . and maybe when he then",
      "Help.",
      "You’re right. It’s a terrible idea.",
      "It’s one of your worst ideas ever.",
      "Got it! We deliver it ourselves — we wait forty years — we deliver it —",
      "Not a chance — once Delphi has set time the way she wants she’ll send armies to try and find",
      "So we hide in a hole?",
      "As pleasurable as it will be to hide in a hole with you for the next forty years . . . they’ll find us.",
      "There’s nothing. Still, if I had to choose a companion to be at the return of eternal darkness",
      "No offense, but I’d choose someone massive and really good at magic.",
      "Well, it is a moderately cold day.",
      "He always said — it’s the only thing he had from her. Look at the love with which she’s put it",
      "And I wish I could tell my dad — well, I’m not sure what. I think I’d like to tell him that I’m",
      "Scorpius — my dad still has that blanket.",
      "That won’t work. If we write a message on it now, even really small, he’ll read it too soon.",
      "What do you know about love potions? What’s the ingredient they all contain?",
      "Amongst other things, pearl dust.",
      "Pearl dust is a relatively rare ingredient, isn’t it?",
      "Mainly because it’s pretty expensive. What’s this about, Albus?",
      "Dad and I had a fight on the day before I went to school.",
      "This I am aware of. I believe it kind of got us into this mess.",
      "I threw the blanket across the room. It collided with the love potion that Uncle Ron gave me as",
      "He’s a funny guy.",
      "The potion spilt and the blanket was covered in it and I happen to know for a fact Mum hasn’t",
      "So?",
      "So it’s coming up to Hallows’ Eve in their time as well as ours — and he told me he always",
      "No. Still not getting you.",
      "What reacts with pearl dust?",
      "Well, it is said that if tincture of Demiguise and pearl dust meet . . . they burn.",
      "And is tincture of (he’s unsure how to say the word) Demiguise visible to the naked eye?",
      "No.",
      "So if we were to get that blanket and write on it in tincture of Demiguise, then . . .",
      "Nothing would react to it until it came into contact with the love potion. In your",
      "We just need to work out where to find some . . . Demiguises.",
      "You know, rumor has it Bathilda Bagshot never saw the point in witches and wizards"
    ],
    [
      "Surprised to find you here.",
      "Don’t worry, I haven’t touched anything. Your shrine is preserved. (He winces.) Sorry. Bad",
      "I was wrong — to blame you. I always accuse you of jumping to things and it was me who —",
      "You don’t think this is my fault?",
      "Harry, he was kidnapped by a powerful Dark witch, how can that be your fault?",
      "I chased him away. I chased him to her.",
      "Can we not treat this as if the battle is already lost?",
      "I’m sorry, Gin . . .",
      "Are you not listening to me? I’m sorry too.",
      "I shouldn’t have survived — it was my destiny to die — even Dumbledore thought so — and",
      "They were killed by Voldemort.",
      "But if I’d stopped him sooner? All that blood on my hands. And now our son has been taken",
      "He’s not dead. Do you hear me, Harry? He’s not dead.",
      "The Boy Who Lived. How many people have to die for the Boy Who Lived?",
      "Harry, it has — something — written —",
      "“Dad . . .”",
      "We’re starting with “Dad”?",
      "So he’ll know it’s from me.",
      "Harry is his name. We should start with “Harry.”",
      "We’re starting with “Dad.”",
      "“Dad,” does it say, “Dad”? It’s not that distinct . . .",
      "“Dad, HELP.”",
      "“Hello”? Does that say “Hello”? And then . . . “Good.”",
      "“Dad Hello Good Hello”? No. This is . . . a strange joke.",
      "“Dad. Help. Godric’s Hollow.”",
      "Give me that. My eyesight is better than yours. Yes. “Dad Hello Good” — that’s not “Hello”",
      "No. It’s a date. 31st October, 1981. The date my parents were killed.",
      "That doesn’t say “Hello.” It says “Help.”",
      "“Dad. Help. Godric’s Hollow. 31/10/81.” It’s a message. Clever boy left me a message.",
      "Albus wrote this?",
      "And he’s told me where they are and when they are and now we know where she is, we know",
      "We haven’t got them back again yet.",
      "I’ll send an owl to Hermione. You send one to Draco. Tell them to meet us at Godric’s with the",
      "And it is “us,” okay? Don’t even think about going back without me, Harry.",
      "Of course you’re coming. We have a chance, Ginny, and by Dumbledore — that’s all that we"
    ],
    [
      "Godric’s Hollow. It must be twenty years . . .",
      "Is it just me or are there more Muggles about . . .",
      "It’s become quite popular as a weekend break.",
      "I can see why — look at the thatched roofs. And is that a farmers’ market?",
      "You remember when we were last here? This feels just like old times.",
      "Old times with a few unwelcome ponytails added to the mix.",
      "Can I just say —",
      "Malfoy, you may be all chummy chummy with Harry, and you may have produced a relatively",
      "And your wife doesn’t need you fighting her battles for her.",
      "Fine. But if you say one thing about her or me . . .",
      "You’ll do what, Weasley?",
      "He’ll hug you. Because we’re all on the same team, aren’t we, Ron?",
      "Fine. I, um, I think you’ve got really nice hair.",
      "Thank you, husband. Now this seems a good spot. Let’s do this.",
      "So? Has it worked?"
    ],
    [
      "MUM?",
      "Albus Severus Potter. Are we pleased to see you.",
      "You got our note . . . ?",
      "We got your note.",
      "We can hug too if you like . . .",
      "Now, where’s this Delphi?",
      "You know about Delphi?",
      "She’s here — she’s trying to kill you, we think. Before Voldemort curses himself she’s going",
      "Yes, we thought that might be it too. Do you know where specifically she is now?",
      "She’s disappeared. How did you — how did you, without the Time-Turner —",
      "That’s a long and complicated story, Scorpius. And we don’t have time for it.",
      "Harry’s right. Time is of the essence. We need to get people into position. Now, Godric’s"
    ],
    [
      "No. Nothing. Why isn’t she here?",
      "We’re together, your mum and dad are alive — we can turn time, Harry, we can’t speed it up.",
      "Poor kid thought he had to save the world.",
      "Poor kid has saved the world. That blanket was masterful. I mean, he also almost destroyed the",
      "You think he’s okay?",
      "He’s getting there, it just might take him a bit of time — and you a bit of time too.",
      "I remember.",
      "After I came out of hospital — everyone ignored me, shut me out — other than, that is, the boy",
      "You think that’s what we’re missing — Exploding Snap?",
      "No. But the love I felt from you that day — I’m not sure Albus feels that.",
      "I’d do anything for him.",
      "Harry, you’d do anything for anybody. You were pretty happy to sacrifice yourself for the",
      "You know, it wasn’t until we thought Albus had gone that I truly understood what my mother",
      "And the only spell Voldemort couldn’t understand — love.",
      "I do love him specifically, Ginny.",
      "I know, but he needs to feel it.",
      "I’m lucky to have you, aren’t I?",
      "Extremely. And I’d be delighted to discuss just how lucky at another time. But for now — let’s",
      "We are running out of time.",
      "Unless — Harry, has anyone thought — why has she picked now? Today?",
      "Because this is the day that everything changed . . .",
      "Right now you’re over a year old, am I right?",
      "A year and three months.",
      "That’s a year and three months she could have killed you in. Even now, she’s been in Godric’s",
      "I’m still not entirely following —",
      "What if she’s not waiting for you — she’s waiting for him . . . to stop him.",
      "What?",
      "Delphi’s picked tonight because he’s here — because her father is coming. She wants to meet",
      "He’d have only got more powerful — the darkness would only have got darker.",
      "The best way to break the prophecy is not to kill Harry Potter, it’s to stop Voldemort doing"
    ],
    [
      "So let me get this right — we’re fighting to protect Voldemort?",
      "Voldemort killing my grandparents. Voldemort trying to kill my dad?",
      "Of course, Ginny. Delphi’s not trying to kill Harry — she’s stopping Voldemort trying to",
      "So — we just wait? Until Voldemort turns up?",
      "Does she know when he does turn up? Hasn’t she come here twenty-four hours early because",
      "You’re not wrong.",
      "Blimey! There are two of them!",
      "So how can we use this to our advantage?",
      "Do you know what I’m really good at?",
      "There’s plenty you’re good at, Albus.",
      "Polyjuicing. And I think Bathilda Bagshot may have all the ingredients for Polyjuice in her",
      "To use Polyjuice you need a bit of someone. We don’t have a bit of Voldemort.",
      "But I like the concept, a pretend mouse for her cat.",
      "How close can we get through Transfiguration?",
      "We know what he looks like. We’ve got some excellent wizards and witches here.",
      "You want to transfigure into Voldemort?",
      "It’s the only way.",
      "It is, isn’t it?",
      "Then I would like to — I think I should be him. I mean, it won’t be — exactly nice being",
      "Who are you calling intense?",
      "I’d also like to volunteer. I think being Voldemort requires precision — no offense, Ron —",
      "And I’d like to volunteer too. As Minister for Magic I think it’s my responsibility and right.",
      "Maybe we should draw lots —",
      "You’re not volunteering, Scorpius.",
      "Actually —",
      "No, no way. I think you’re all mad. I know what that voice is like inside your head — I won’t",
      "And anyway — it has to be me.",
      "What?",
      "For this plan to work she has to believe it’s him, without hesitation. She’ll use Parseltongue —",
      "Rubbish. Beautifully put but beautiful rubbish. No way are you going to —",
      "I’m afraid you’re right, my old friend.",
      "Hermione, you’re wrong, Voldemort is not something to be — Harry should not —",
      "And I hate to agree with my brother, but —",
      "He could get stuck — as Voldemort — forever.",
      "So could any of us. Your concerns are valid, but . . .",
      "Hang on, Hermione. Gin.",
      "You’re right.",
      "Then let’s do this.",
      "Don’t we need to discuss the route you’re taking — the —",
      "She’s watching for him — she’ll come to me.",
      "And then what? When she’s with you. May I remind you this is a very powerful witch.",
      "Easy. He gets her in here. We zap her together.",
      "“Zap her”?",
      "We’ll hide behind these doors. If you can get her to this point, Harry (she indicates the",
      "And then we’ll zap her.",
      "Harry, last chance, are you sure you can do this?",
      "Yes, I can do this.",
      "No, there’s too many what-ifs — too many things that can go wrong — the Transfiguration",
      "Draco, trust my dad. He won’t let us down.",
      "Wands.",
      "Bloody hell.",
      "It worked, then?",
      "Yes. It worked."
    ],
    [
      "It’s going to be okay, you know that, Mum?",
      "I know it is. Or I hope I do. I just — don’t want to see him like that. The man I love shrouded in",
      "I liked her, Mum, you know that? I really liked her. Delphi. And she was — Voldemort’s",
      "That’s what they’re good at, Albus — catching innocents in their web.",
      "This is all my fault.",
      "How funny. Your dad seems to think it’s all his. Strange pair that you are.",
      "That’s her. That’s her. She’s seen him.",
      "Positions. Everybody. And remember, don’t come out until he’s got her in the light —",
      "Hermione Granger, I’m being bossed around by Hermione Granger. (She turns towards him.",
      "Dad . . .",
      "Whichever witch or wizard is following me, I assure you, you will regret it.",
      "Lord Voldemort. It is me. I am following you.",
      "I do not know you. Leave me.",
      "I am your daughter.",
      "If you were my daughter, I’d know of you.",
      "I am from the future. The child of Bellatrix Lestrange and you. I was born in Malfoy Manor",
      "I am familiar with Bellatrix and there are certain similarities in your face —",
      "I am the Augurey to your Dark Lord, and I am ready to give all that I have to serve you.",
      "You learnt — flight — from — me?",
      "I have tried to follow the path you set.",
      "I have never met a witch or a wizard who’s attempted to be my equal before.",
      "Do not mistake — I would not claim to be worthy of you, Lord. But I have devoted my life to",
      "I see what you are, and I see what you could be. Daughter.",
      "Father?",
      "Together, the power we could wield.",
      "Father . . .",
      "Come here, in the light, so I may examine what my blood made.",
      "Your mission is a mistake. Attacking Harry Potter is a mistake. He will destroy you.",
      "He is a baby.",
      "He has his mother ’s love. Your spell will rebound, destroying you and making him too",
      "Then I won’t attack him. You are right.",
      "Father?",
      "Your plan is a good one. The fight is off. You",
      "Father . . .",
      "Incendio!",
      "Potter. Colloportus!",
      "Harry . . . Harry . . .",
      "She’s sealed the doors from your side.",
      "Fine. I’ll deal with you alone.",
      "I’ve watched you for a long time, Harry Potter. I know you better than my father did.",
      "You think you’ve learnt my weaknesses?",
      "I’ve studied to be worthy of him! Yes, even though he is the supreme wizard of all time, he",
      "Dad . . .",
      "Albus! No!",
      "Two of you? Choices, choices. I think I’ll kill the boy first. Avada Kedavra!",
      "No. I’m not.",
      "Alohomora! Alohomora!",
      "I’ve never fought alone, you see. And I never will.",
      "No . . . No . . .",
      "Brachiabindo!",
      "Albus, are you okay?",
      "Yes, Dad, I’m okay.",
      "Ginny, has he been injured? I need to know he’s safe . . .",
      "He insisted. He was the only one small enough to crawl through the grate. I tried to stop him.",
      "Just tell me he’s okay.",
      "I’m fine, Dad. I promise.",
      "A lot of people have tried to hurt me — but my son! You dare hurt my son!",
      "I only wanted to know my father.",
      "You can’t remake your life. You’ll always be an orphan. That never leaves you.",
      "Just let me — see him.",
      "I can’t and I won’t.",
      "Then kill me.",
      "I can’t do that either.",
      "What? Dad? She’s dangerous.",
      "No, Albus . . .",
      "But she’s a murderer — I’ve seen her murder —",
      "Yes. Albus, she’s a murderer, and we’re not.",
      "We have to be better than them.",
      "Yeah, it’s annoying but it’s what we learnt.",
      "Take my mind. Take my memory. Make me forget who I am.",
      "No. We’ll take you back to our time.",
      "And you’ll go to Azkaban. Same as your mother.",
      "Where you’ll rot.",
      "What’s that?",
      "No. No. Not yet.",
      "What?",
      "Voldemort.",
      "Father?",
      "Now? Here?",
      "Father!",
      "Silencio! (DELPHI is gagged.) Wingardium Leviosa! (She is sent upwards and away.)",
      "He’s coming. He’s coming right now."
    ],
    [
      "Voldemort is going to kill my mum and dad — and there’s nothing I can do to stop him.",
      "That’s not true.",
      "Dad, now is not the time . . .",
      "There is something you could do — to stop him. But you won’t.",
      "That’s heroic.",
      "You don’t have to watch, Harry. We can go home.",
      "I’m letting it happen . . . Of course I have to watch.",
      "Then we’ll all witness it.",
      "We’ll all watch.",
      "Lily, take Harry and go! It’s him! Go! Run! I’ll hold him off . . .",
      "Avada Kedavra!",
      "He did everything he could.",
      "That’s my mum, at the window. I can see my mother, she looks beautiful.",
      "Not Harry, not Harry, please not Harry . . .",
      "Stand aside, you silly girl . . . Stand aside, now . . .",
      "Not Harry, please no, take me, kill me instead . . .",
      "This is my last warning —",
      "Not Harry! Please . . . Have mercy . . . have mercy . . . Not my son! Please — I’ll do",
      "Avada Kedavra!"
    ],
    [
      "James?"
    ],
    [
      "I can’t quite believe I did that.",
      "I can’t quite believe you did that either.",
      "Rose Granger-Weasley. I asked out Rose Granger-Weasley.",
      "And she said no.",
      "But I asked her. I planted the acorn. The acorn that will grow into our eventual marriage.",
      "You are aware that you’re an utter fantasist.",
      "And I’d agree with you — only Polly Chapman did ask me to the school ball . . .",
      "In an alternate reality where you were significantly — really significantly more popular — a",
      "And yes, logic would dictate I should be pursuing Polly — or allowing her to pursue me —",
      "You know logic would dictate that you’re a freak? Rose hates you.",
      "Correction, she used to hate me, but did you see the look in her eyes when I asked? That",
      "And pity’s good?",
      "Pity is a start, my friend, a foundation on which to build a palace — a palace of love.",
      "I honestly thought I’d be the first of us to get a girlfriend.",
      "Oh, you will, undoubtedly, probably that new smoky-eyed Potions professor — she’s old",
      "I don’t have a thing about older women!",
      "And you’ve got time — a lot of time — to seduce her. Because Rose is going to take years",
      "I admire your confidence.",
      "Hi.",
      "Received and entirely understood.",
      "Okay. “Scorpion King.”",
      "Maybe you’re right — pity is a start.",
      "Are you heading to Quidditch? Slytherin are playing Hufflepuff — it’s a big one —",
      "I thought we hated Quidditch?",
      "People can change. Besides, I’ve been practicing. I think I might make the team eventually.",
      "I can’t. My dad’s arranged to come up —",
      "He’s taking time away from the Ministry?",
      "He wants to go on a walk — something to show me — share with me — something.",
      "A walk?",
      "I know, I think it’s a bonding thing or something similarly vomit-inducing. Still, you know, I",
      "I wasn’t sure. Whether we should. In this new version of us — I had in my head.",
      "Better ask Rose if it’s the right thing to do.",
      "Ha! Yeah. Right.",
      "I’ll see you at dinner."
    ],
    [
      "So are you ready?",
      "For what?",
      "Well, there’s the fourth-year exams — and then the fifth year — big year — in my fifth year I",
      "Good to know.",
      "Yes?",
      "I think you’d have liked them. And I think me, Lily, and James would have liked them too.",
      "You know, I thought I’d lost him — Voldemort — I thought I’d lost him — and then my scar",
      "And had he?",
      "The part of me that was Voldemort died a long time ago, but it wasn’t enough to be physically",
      "Dad, you don’t need to —",
      "You told me you don’t think I’m scared of anything, and that — I mean, I’m scared of",
      "Harry Potter is afraid of the dark?",
      "I don’t like small spaces and — I’ve never told anyone this, but I don’t much like — (he",
      "You don’t like pigeons?",
      "Nasty, pecky, dirty things. They give me the creeps.",
      "But pigeons are harmless!",
      "I know. But the thing that scares me most, Albus Severus Potter, is being a dad to you. Because",
      "And I’ll try and be a better son. I know I’m not James, Dad, I’ll never be like you two —",
      "James is nothing like me.",
      "Isn’t he?",
      "Everything comes easy for James. My childhood was a constant struggle.",
      "So was mine. So you’re saying — am I — like you?",
      "Actually you’re more like your mum — bold, fierce, funny — which I like — which I think",
      "I almost destroyed the world.",
      "Delphi wasn’t going anywhere, Albus — you brought her out into the light and you found a",
      "But shouldn’t I have done better?",
      "You don’t think I ask myself the same questions?",
      "And then — when we",
      "You’d watched her murder Craig, you were angry, Albus, and that’s okay. And you wouldn’t",
      "How do you know that? Maybe that’s my Slytherin side. Maybe that’s what the Sorting Hat saw",
      "I don’t understand your head, Albus — actually, you know what, you’re a teenager, I shouldn’t",
      "Oh I’m not going to be a wizard, I’m going into pigeon racing. I’m quite excited about it.",
      "Those names you have — they shouldn’t be a burden. Albus Dumbledore had his trials too,",
      "They were good men.",
      "They were great men, with huge flaws, and you know what — those flaws almost made them",
      "Dad? Why are we here?",
      "This is where I often come.",
      "But this is a graveyard . . .",
      "And here is Cedric’s grave.",
      "Dad?",
      "The boy who was killed — Craig Bowker — how well did you know him?",
      "Not well enough.",
      "I didn’t know Cedric well enough either. He could have played Quidditch for England. Or been",
      "That’s a — good thing to do.",
      "I think it’s going to be a nice day.",
      "So do I."
    ]
  ]
}